{
  "0": "<unk>",
  "1": "<|nospeech|>",
  "2": "<pad>",
  "3": "<|endoftext|>",
  "4": "<|startoftranscript|>",
  "5": "<|pnc|>",
  "6": "<|nopnc|>",
  "7": "<|startofcontext|>",
  "8": "<|itn|>",
  "9": "<|noitn|>",
  "10": "<|timestamp|>",
  "11": "<|notimestamp|>",
  "12": "<|diarize|>",
  "13": "<|nodiarize|>",
  "14": "<|spkchange|>",
  "15": "<|audioseparator|>",
  "16": "<|emo:undefined|>",
  "17": "<|emo:neutral|>",
  "18": "<|emo:happy|>",
  "19": "<|emo:sad|>",
  "20": "<|emo:angry|>",
  "21": "<|unklang|>",
  "22": "<|predict_lang|>",
  "23": "<|nopredict_lang|>",
  "24": "<|aa|>",
  "25": "<|ab|>",
  "26": "<|af|>",
  "27": "<|ak|>",
  "28": "<|sq|>",
  "29": "<|am|>",
  "30": "<|ar|>",
  "31": "<|an|>",
  "32": "<|hy|>",
  "33": "<|as|>",
  "34": "<|av|>",
  "35": "<|ae|>",
  "36": "<|ay|>",
  "37": "<|az|>",
  "38": "<|bm|>",
  "39": "<|ba|>",
  "40": "<|eu|>",
  "41": "<|be|>",
  "42": "<|bn|>",
  "43": "<|bi|>",
  "44": "<|bs|>",
  "45": "<|br|>",
  "46": "<|bg|>",
  "47": "<|my|>",
  "48": "<|ca|>",
  "49": "<|ch|>",
  "50": "<|ce|>",
  "51": "<|ny|>",
  "52": "<|zh|>",
  "53": "<|cu|>",
  "54": "<|cv|>",
  "55": "<|kw|>",
  "56": "<|co|>",
  "57": "<|cr|>",
  "58": "<|hr|>",
  "59": "<|cs|>",
  "60": "<|da|>",
  "61": "<|dv|>",
  "62": "<|nl|>",
  "63": "<|dz|>",
  "64": "<|en|>",
  "65": "<|eo|>",
  "66": "<|et|>",
  "67": "<|ee|>",
  "68": "<|fo|>",
  "69": "<|fj|>",
  "70": "<|fi|>",
  "71": "<|fr|>",
  "72": "<|fy|>",
  "73": "<|ff|>",
  "74": "<|gd|>",
  "75": "<|gl|>",
  "76": "<|lg|>",
  "77": "<|ka|>",
  "78": "<|de|>",
  "79": "<|el|>",
  "80": "<|kl|>",
  "81": "<|gn|>",
  "82": "<|gu|>",
  "83": "<|ht|>",
  "84": "<|ha|>",
  "85": "<|he|>",
  "86": "<|hz|>",
  "87": "<|hi|>",
  "88": "<|ho|>",
  "89": "<|hu|>",
  "90": "<|is|>",
  "91": "<|io|>",
  "92": "<|ig|>",
  "93": "<|id|>",
  "94": "<|ia|>",
  "95": "<|ie|>",
  "96": "<|iu|>",
  "97": "<|ik|>",
  "98": "<|ga|>",
  "99": "<|it|>",
  "100": "<|ja|>",
  "101": "<|jv|>",
  "102": "<|kn|>",
  "103": "<|kr|>",
  "104": "<|ks|>",
  "105": "<|kk|>",
  "106": "<|km|>",
  "107": "<|ki|>",
  "108": "<|rw|>",
  "109": "<|ky|>",
  "110": "<|kv|>",
  "111": "<|kg|>",
  "112": "<|ko|>",
  "113": "<|kj|>",
  "114": "<|ku|>",
  "115": "<|lo|>",
  "116": "<|la|>",
  "117": "<|lv|>",
  "118": "<|li|>",
  "119": "<|ln|>",
  "120": "<|lt|>",
  "121": "<|lu|>",
  "122": "<|lb|>",
  "123": "<|mk|>",
  "124": "<|mg|>",
  "125": "<|ms|>",
  "126": "<|ml|>",
  "127": "<|mt|>",
  "128": "<|gv|>",
  "129": "<|mi|>",
  "130": "<|mr|>",
  "131": "<|mh|>",
  "132": "<|mn|>",
  "133": "<|na|>",
  "134": "<|nv|>",
  "135": "<|nd|>",
  "136": "<|nr|>",
  "137": "<|ng|>",
  "138": "<|ne|>",
  "139": "<|no|>",
  "140": "<|nb|>",
  "141": "<|nn|>",
  "142": "<|oc|>",
  "143": "<|oj|>",
  "144": "<|or|>",
  "145": "<|om|>",
  "146": "<|os|>",
  "147": "<|pi|>",
  "148": "<|ps|>",
  "149": "<|fa|>",
  "150": "<|pl|>",
  "151": "<|pt|>",
  "152": "<|pa|>",
  "153": "<|qu|>",
  "154": "<|ro|>",
  "155": "<|rm|>",
  "156": "<|rn|>",
  "157": "<|ru|>",
  "158": "<|se|>",
  "159": "<|sm|>",
  "160": "<|sg|>",
  "161": "<|sa|>",
  "162": "<|sc|>",
  "163": "<|sr|>",
  "164": "<|sn|>",
  "165": "<|sd|>",
  "166": "<|si|>",
  "167": "<|sk|>",
  "168": "<|sl|>",
  "169": "<|so|>",
  "170": "<|st|>",
  "171": "<|es|>",
  "172": "<|su|>",
  "173": "<|sw|>",
  "174": "<|ss|>",
  "175": "<|sv|>",
  "176": "<|tl|>",
  "177": "<|ty|>",
  "178": "<|tg|>",
  "179": "<|ta|>",
  "180": "<|tt|>",
  "181": "<|te|>",
  "182": "<|th|>",
  "183": "<|bo|>",
  "184": "<|ti|>",
  "185": "<|to|>",
  "186": "<|ts|>",
  "187": "<|tn|>",
  "188": "<|tr|>",
  "189": "<|tk|>",
  "190": "<|tw|>",
  "191": "<|ug|>",
  "192": "<|uk|>",
  "193": "<|ur|>",
  "194": "<|uz|>",
  "195": "<|ve|>",
  "196": "<|vi|>",
  "197": "<|vo|>",
  "198": "<|wa|>",
  "199": "<|cy|>",
  "200": "<|wo|>",
  "201": "<|xh|>",
  "202": "<|ii|>",
  "203": "<|yi|>",
  "204": "<|yo|>",
  "205": "<|za|>",
  "206": "<|zu|>",
  "207": "<|0|>",
  "208": "<|1|>",
  "209": "<|2|>",
  "210": "<|3|>",
  "211": "<|4|>",
  "212": "<|5|>",
  "213": "<|6|>",
  "214": "<|7|>",
  "215": "<|8|>",
  "216": "<|9|>",
  "217": "<|10|>",
  "218": "<|spk0|>",
  "219": "<|spk1|>",
  "220": "<|spk2|>",
  "221": "<|spk3|>",
  "222": "<|spk4|>",
  "223": "<|spk5|>",
  "224": "<|spk6|>",
  "225": "<|spk7|>",
  "226": "<|spk8|>",
  "227": "<|spk9|>",
  "228": "<|spk10|>",
  "229": "<|spk11|>",
  "230": "<|spk12|>",
  "231": "<|spk13|>",
  "232": "<|spk14|>",
  "233": "<|spk15|>",
  "234": "0",
  "235": "1",
  "236": "2",
  "237": "3",
  "238": "4",
  "239": "5",
  "240": "6",
  "241": "7",
  "242": "8",
  "243": "9",
  "244": "<|spltoken0|>",
  "245": "<|spltoken1|>",
  "246": "<|spltoken2|>",
  "247": "<|spltoken3|>",
  "248": "<|spltoken4|>",
  "249": "<|spltoken5|>",
  "250": "<|spltoken6|>",
  "251": "<|spltoken7|>",
  "252": "<|spltoken8|>",
  "253": "<|spltoken9|>",
  "254": "<|spltoken10|>",
  "255": "<|spltoken11|>",
  "256": "<|spltoken12|>",
  "257": "<|spltoken13|>",
  "258": "<|spltoken14|>",
  "259": "<|spltoken15|>",
  "260": "<|spltoken16|>",
  "261": "<|spltoken17|>",
  "262": "<|spltoken18|>",
  "263": "<|spltoken19|>",
  "264": "<|spltoken20|>",
  "265": "<|spltoken21|>",
  "266": "<|spltoken22|>",
  "267": "<|spltoken23|>",
  "268": "<|spltoken24|>",
  "269": "<|spltoken25|>",
  "270": "<|spltoken26|>",
  "271": "<|spltoken27|>",
  "272": "<|spltoken28|>",
  "273": "<|spltoken29|>",
  "274": "en",
  "275": " s",
  "276": " d",
  "277": "er",
  "278": " p",
  "279": " a",
  "280": " t",
  "281": "in",
  "282": " m",
  "283": "es",
  "284": "an",
  "285": " n",
  "286": " v",
  "287": "ar",
  "288": " k",
  "289": "on",
  "290": "is",
  "291": "et",
  "292": "el",
  "293": " l",
  "294": "or",
  "295": "al",
  "296": "at",
  "297": "as",
  "298": " c",
  "299": " o",
  "300": " j",
  "301": "it",
  "302": " b",
  "303": " h",
  "304": "ie",
  "305": "il",
  "306": "re",
  "307": " u",
  "308": "os",
  "309": " f",
  "310": "ch",
  "311": "em",
  "312": " i",
  "313": "om",
  "314": "ra",
  "315": "te",
  "316": "am",
  "317": " g",
  "318": " de",
  "319": "ad",
  "320": "ro",
  "321": "ti",
  "322": " z",
  "323": "us",
  "324": "ol",
  "325": " e",
  "326": "ed",
  "327": "ta",
  "328": " w",
  "329": " п",
  "330": "ri",
  "331": "un",
  "332": "li",
  "333": " н",
  "334": " in",
  "335": "id",
  "336": " с",
  "337": "le",
  "338": " в",
  "339": "ak",
  "340": "ent",
  "341": "qu",
  "342": "то",
  "343": " S",
  "344": "ur",
  "345": "ik",
  "346": " A",
  "347": " se",
  "348": "im",
  "349": "od",
  "350": "ci",
  "351": "ut",
  "352": " un",
  "353": "ov",
  "354": " je",
  "355": "ul",
  "356": " M",
  "357": " T",
  "358": " na",
  "359": "ot",
  "360": " D",
  "361": " д",
  "362": " E",
  "363": " qu",
  "364": " en",
  "365": "est",
  "366": " to",
  "367": "eg",
  "368": "st",
  "369": "ai",
  "370": "ag",
  "371": "ij",
  "372": "ра",
  "373": " P",
  "374": "та",
  "375": " r",
  "376": "ud",
  "377": "ek",
  "378": "ig",
  "379": " τ",
  "380": " I",
  "381": "ing",
  "382": " N",
  "383": "ни",
  "384": "av",
  "385": "um",
  "386": "ко",
  "387": "ia",
  "388": "he",
  "389": "те",
  "390": "но",
  "391": " на",
  "392": "ва",
  "393": " la",
  "394": "ро",
  "395": " з",
  "396": "og",
  "397": " о",
  "398": "ist",
  "399": "ir",
  "400": " м",
  "401": "de",
  "402": " и",
  "403": "la",
  "404": "ic",
  "405": " st",
  "406": " J",
  "407": " at",
  "408": " po",
  "409": " ne",
  "410": " pr",
  "411": " an",
  "412": "ли",
  "413": " al",
  "414": "aj",
  "415": "ти",
  "416": "iv",
  "417": " C",
  "418": "ре",
  "419": "je",
  "420": " по",
  "421": "ка",
  "422": "на",
  "423": " es",
  "424": "and",
  "425": " H",
  "426": " B",
  "427": " re",
  "428": "ου",
  "429": "ok",
  "430": " K",
  "431": " on",
  "432": "ne",
  "433": " pro",
  "434": "to",
  "435": " б",
  "436": "ab",
  "437": " π",
  "438": "ou",
  "439": " L",
  "440": "го",
  "441": "ter",
  "442": "ien",
  "443": " que",
  "444": " V",
  "445": " da",
  "446": "ja",
  "447": "na",
  "448": "ka",
  "449": "ри",
  "450": " par",
  "451": " su",
  "452": " O",
  "453": " et",
  "454": "ion",
  "455": " ja",
  "456": "να",
  "457": " α",
  "458": " do",
  "459": " y",
  "460": " el",
  "461": "ru",
  "462": " é",
  "463": "ce",
  "464": " κ",
  "465": " di",
  "466": " σ",
  "467": "se",
  "468": " er",
  "469": "ст",
  "470": "ma",
  "471": " con",
  "472": " ε",
  "473": "no",
  "474": "ap",
  "475": " si",
  "476": "ен",
  "477": "me",
  "478": " te",
  "479": "ni",
  "480": " ч",
  "481": " le",
  "482": " μ",
  "483": " ma",
  "484": "än",
  "485": " sp",
  "486": " за",
  "487": "ost",
  "488": "end",
  "489": "ko",
  "490": "are",
  "491": " com",
  "492": "ke",
  "493": " no",
  "494": "är",
  "495": "ла",
  "496": "ers",
  "497": " G",
  "498": " sa",
  "499": " W",
  "500": " ir",
  "501": "ere",
  "502": " vi",
  "503": " li",
  "504": " не",
  "505": " ž",
  "506": " the",
  "507": "ve",
  "508": " is",
  "509": " for",
  "510": "ob",
  "511": "ле",
  "512": "во",
  "513": "si",
  "514": "αι",
  "515": " F",
  "516": " il",
  "517": " U",
  "518": " R",
  "519": "ть",
  "520": "ali",
  "521": "ine",
  "522": "sa",
  "523": " ко",
  "524": " š",
  "525": " me",
  "526": "va",
  "527": "ant",
  "528": "vo",
  "529": "ει",
  "530": "ell",
  "531": " vo",
  "532": "ill",
  "533": " det",
  "534": "ast",
  "535": " ar",
  "536": " î",
  "537": "ze",
  "538": " ra",
  "539": "ho",
  "540": "ju",
  "541": "ör",
  "542": "ки",
  "543": "ль",
  "544": " ni",
  "545": "ви",
  "546": "ло",
  "547": " so",
  "548": "ver",
  "549": " pre",
  "550": " я",
  "551": " ta",
  "552": " th",
  "553": " е",
  "554": "tu",
  "555": " be",
  "556": "да",
  "557": "pp",
  "558": "ind",
  "559": "ge",
  "560": " du",
  "561": "ess",
  "562": "ks",
  "563": " od",
  "564": "ku",
  "565": "ся",
  "566": "ac",
  "567": "ele",
  "568": "ια",
  "569": "zy",
  "570": "ran",
  "571": "ten",
  "572": "io",
  "573": " în",
  "574": "ма",
  "575": " and",
  "576": "де",
  "577": " ka",
  "578": " да",
  "579": "ди",
  "580": "ate",
  "581": "iz",
  "582": "ite",
  "583": "sk",
  "584": "ente",
  "585": " у",
  "586": " za",
  "587": " per",
  "588": " pri",
  "589": " im",
  "590": " som",
  "591": "da",
  "592": " of",
  "593": "τα",
  "594": " des",
  "595": "τι",
  "596": "ow",
  "597": "ве",
  "598": "ny",
  "599": " op",
  "600": "τε",
  "601": " ob",
  "602": " den",
  "603": " ro",
  "604": "ui",
  "605": " до",
  "606": "az",
  "607": " про",
  "608": "же",
  "609": " ve",
  "610": "ão",
  "611": " ko",
  "612": "iem",
  "613": "не",
  "614": " ver",
  "615": " die",
  "616": "ens",
  "617": " mo",
  "618": " as",
  "619": "gy",
  "620": "au",
  "621": "ort",
  "622": " δ",
  "623": " der",
  "624": " ș",
  "625": " van",
  "626": " min",
  "627": " ch",
  "628": "ier",
  "629": "lu",
  "630": "lo",
  "631": " og",
  "632": " att",
  "633": " то",
  "634": " č",
  "635": "ji",
  "636": "pr",
  "637": " var",
  "638": "du",
  "639": " та",
  "640": " tr",
  "641": " ab",
  "642": " om",
  "643": " να",
  "644": "що",
  "645": "ust",
  "646": "gen",
  "647": " sk",
  "648": "ми",
  "649": "ál",
  "650": "den",
  "651": "ff",
  "652": " by",
  "653": "mi",
  "654": "ás",
  "655": "ati",
  "656": " се",
  "657": " und",
  "658": " το",
  "659": " um",
  "660": "ля",
  "661": " est",
  "662": "га",
  "663": "all",
  "664": "ме",
  "665": " iz",
  "666": "eb",
  "667": "ans",
  "668": " τη",
  "669": "op",
  "670": "мо",
  "671": " мо",
  "672": " от",
  "673": "ga",
  "674": " mu",
  "675": " а",
  "676": "ys",
  "677": " pas",
  "678": " ка",
  "679": " nu",
  "680": " к",
  "681": " Z",
  "682": " del",
  "683": " mi",
  "684": "dz",
  "685": "għ",
  "686": " tal",
  "687": " med",
  "688": " tak",
  "689": " och",
  "690": "kt",
  "691": " ac",
  "692": " am",
  "693": "ní",
  "694": " au",
  "695": "nd",
  "696": "πο",
  "697": "ont",
  "698": " man",
  "699": " pe",
  "700": "iti",
  "701": " και",
  "702": " pod",
  "703": "sz",
  "704": " și",
  "705": "ej",
  "706": "ki",
  "707": " pl",
  "708": " ku",
  "709": " av",
  "710": " ви",
  "711": "ord",
  "712": "ha",
  "713": " het",
  "714": "ada",
  "715": "το",
  "716": "ρο",
  "717": " pos",
  "718": " т",
  "719": "tä",
  "720": "iet",
  "721": "cht",
  "722": "ale",
  "723": "ру",
  "724": "ina",
  "725": "ck",
  "726": "po",
  "727": " že",
  "728": "wa",
  "729": "ρα",
  "730": " tu",
  "731": "ade",
  "732": " nie",
  "733": " έ",
  "734": " sz",
  "735": "ili",
  "736": "ba",
  "737": "át",
  "738": " på",
  "739": "pe",
  "740": " ό",
  "741": "по",
  "742": " ра",
  "743": " ex",
  "744": "ija",
  "745": "iss",
  "746": " em",
  "747": "ala",
  "748": "ber",
  "749": " ц",
  "750": " we",
  "751": "gi",
  "752": " és",
  "753": " ik",
  "754": "μα",
  "755": "ше",
  "756": " os",
  "757": " Т",
  "758": " kom",
  "759": "zi",
  "760": " γ",
  "761": "ation",
  "762": "ond",
  "763": "mer",
  "764": "yt",
  "765": " för",
  "766": " sam",
  "767": " ap",
  "768": " ol",
  "769": "ts",
  "770": "be",
  "771": "ні",
  "772": " va",
  "773": "ato",
  "774": " che",
  "775": "че",
  "776": "чи",
  "777": "za",
  "778": " pu",
  "779": "хо",
  "780": " să",
  "781": "ete",
  "782": " een",
  "783": " għ",
  "784": "ät",
  "785": "ven",
  "786": "for",
  "787": "ile",
  "788": " az",
  "789": "τη",
  "790": "bi",
  "791": "jo",
  "792": " че",
  "793": "né",
  "794": "tor",
  "795": "vi",
  "796": "ca",
  "797": " ri",
  "798": "ți",
  "799": " af",
  "800": "ons",
  "801": "ista",
  "802": "äl",
  "803": "му",
  "804": "nie",
  "805": " э",
  "806": "до",
  "807": "ικ",
  "808": " por",
  "809": " і",
  "810": "mo",
  "811": "ug",
  "812": " Н",
  "813": " he",
  "814": "ogy",
  "815": " para",
  "816": "und",
  "817": " das",
  "818": " lo",
  "819": " εί",
  "820": " men",
  "821": "és",
  "822": " що",
  "823": "pl",
  "824": "με",
  "825": "men",
  "826": " ter",
  "827": "ня",
  "828": " В",
  "829": " του",
  "830": "ben",
  "831": "ны",
  "832": " à",
  "833": " har",
  "834": "се",
  "835": " ha",
  "836": "bu",
  "837": " pol",
  "838": " De",
  "839": " or",
  "840": " ο",
  "841": "rav",
  "842": " ein",
  "843": " при",
  "844": "di",
  "845": "so",
  "846": "за",
  "847": "per",
  "848": "art",
  "849": " pa",
  "850": " les",
  "851": " vid",
  "852": " cu",
  "853": " kad",
  "854": " vis",
  "855": "oll",
  "856": " ki",
  "857": " är",
  "858": "rat",
  "859": "ча",
  "860": " dat",
  "861": "ett",
  "862": " что",
  "863": "hr",
  "864": "che",
  "865": " hogy",
  "866": "бо",
  "867": " co",
  "868": "dy",
  "869": " it",
  "870": "ando",
  "871": " En",
  "872": " ce",
  "873": " ge",
  "874": "ung",
  "875": " kan",
  "876": "сто",
  "877": "jen",
  "878": " ser",
  "879": "ще",
  "880": " Ja",
  "881": "ih",
  "882": " го",
  "883": "си",
  "884": "ци",
  "885": "ara",
  "886": " sv",
  "887": "ρι",
  "888": " με",
  "889": " ż",
  "890": "ies",
  "891": " Se",
  "892": " In",
  "893": "bl",
  "894": "ado",
  "895": " jo",
  "896": "ult",
  "897": "jon",
  "898": "res",
  "899": "že",
  "900": " met",
  "901": "der",
  "902": "gu",
  "903": " til",
  "904": " П",
  "905": " meg",
  "906": " ü",
  "907": "ér",
  "908": " бу",
  "909": " una",
  "910": "ram",
  "911": "ση",
  "912": " ho",
  "913": "ym",
  "914": "ку",
  "915": "ich",
  "916": "ore",
  "917": "εί",
  "918": " из",
  "919": "ід",
  "920": "án",
  "921": " tai",
  "922": " С",
  "923": "co",
  "924": " was",
  "925": "ila",
  "926": "ement",
  "927": "νο",
  "928": " kon",
  "929": " ist",
  "930": "ím",
  "931": "pa",
  "932": "ela",
  "933": " nem",
  "934": " val",
  "935": "ata",
  "936": " tem",
  "937": "ang",
  "938": " tie",
  "939": " pot",
  "940": "esti",
  "941": "ón",
  "942": "int",
  "943": "сти",
  "944": " Д",
  "945": "ста",
  "946": "ento",
  "947": "elle",
  "948": "cz",
  "949": " dar",
  "950": " г",
  "951": "ши",
  "952": " пре",
  "953": "bo",
  "954": "ede",
  "955": "red",
  "956": " lu",
  "957": "πό",
  "958": "tr",
  "959": "que",
  "960": "ler",
  "961": "ard",
  "962": " Ma",
  "963": "ego",
  "964": " Al",
  "965": "зи",
  "966": "ну",
  "967": "ini",
  "968": "tav",
  "969": " ei",
  "970": " egy",
  "971": " vol",
  "972": "amo",
  "973": "ib",
  "974": "ste",
  "975": " об",
  "976": "ер",
  "977": "ita",
  "978": "ana",
  "979": "ár",
  "980": "жи",
  "981": "kl",
  "982": " во",
  "983": " те",
  "984": "ijn",
  "985": "лю",
  "986": "сь",
  "987": "ég",
  "988": "ht",
  "989": "isk",
  "990": " Y",
  "991": "nen",
  "992": "ega",
  "993": " tra",
  "994": "ám",
  "995": "nos",
  "996": "cu",
  "997": "ako",
  "998": "ave",
  "999": " oli",
  "1000": " К",
  "1001": " kas",
  "1002": "go",
  "1003": " sem",
  "1004": " To",
  "1005": "ama",
  "1006": "rit",
  "1007": "ναι",
  "1008": "ning",
  "1009": " κα",
  "1010": " М",
  "1011": " că",
  "1012": "ów",
  "1013": "jem",
  "1014": "ър",
  "1015": "ít",
  "1016": "kk",
  "1017": " jed",
  "1018": "ise",
  "1019": " си",
  "1020": " bi",
  "1021": " res",
  "1022": "ých",
  "1023": " kun",
  "1024": " ма",
  "1025": " ale",
  "1026": "era",
  "1027": " mit",
  "1028": "las",
  "1029": "år",
  "1030": " Ne",
  "1031": " Je",
  "1032": " się",
  "1033": " ми",
  "1034": "ly",
  "1035": " θ",
  "1036": " zu",
  "1037": " ú",
  "1038": " fil",
  "1039": "ora",
  "1040": "ния",
  "1041": "att",
  "1042": " bu",
  "1043": "olo",
  "1044": " dem",
  "1045": "ika",
  "1046": "ami",
  "1047": "ito",
  "1048": "eli",
  "1049": "ano",
  "1050": " that",
  "1051": "zt",
  "1052": " О",
  "1053": "áv",
  "1054": "ів",
  "1055": "lig",
  "1056": " για",
  "1057": " př",
  "1058": "ние",
  "1059": "ду",
  "1060": "elt",
  "1061": "би",
  "1062": " fin",
  "1063": " viņ",
  "1064": "ία",
  "1065": "mu",
  "1066": "eda",
  "1067": " sig",
  "1068": " ħ",
  "1069": "υτ",
  "1070": "ων",
  "1071": "uro",
  "1072": "ūs",
  "1073": "eren",
  "1074": " де",
  "1075": "ct",
  "1076": " ich",
  "1077": "λλ",
  "1078": "len",
  "1079": "αν",
  "1080": "ari",
  "1081": " iš",
  "1082": "sp",
  "1083": "ces",
  "1084": " vy",
  "1085": "ida",
  "1086": "лу",
  "1087": " hu",
  "1088": " į",
  "1089": "ās",
  "1090": " uz",
  "1091": " inter",
  "1092": " ро",
  "1093": "agħ",
  "1094": "ky",
  "1095": "εν",
  "1096": "ono",
  "1097": "cia",
  "1098": "ry",
  "1099": "ori",
  "1100": " Il",
  "1101": " ent",
  "1102": " pra",
  "1103": " my",
  "1104": "ille",
  "1105": " Es",
  "1106": "ft",
  "1107": " dis",
  "1108": " pers",
  "1109": " είναι",
  "1110": " ad",
  "1111": " all",
  "1112": "ani",
  "1113": "unt",
  "1114": " Un",
  "1115": "τικ",
  "1116": "one",
  "1117": " tre",
  "1118": " fr",
  "1119": "ante",
  "1120": " И",
  "1121": "жа",
  "1122": "sen",
  "1123": " ότι",
  "1124": "oj",
  "1125": " это",
  "1126": "ві",
  "1127": " ke",
  "1128": "ār",
  "1129": "ane",
  "1130": "па",
  "1131": "do",
  "1132": "ame",
  "1133": "äm",
  "1134": "ici",
  "1135": "ment",
  "1136": " cont",
  "1137": "со",
  "1138": " που",
  "1139": "ban",
  "1140": "ica",
  "1141": " mis",
  "1142": "ет",
  "1143": "alt",
  "1144": "ül",
  "1145": "én",
  "1146": " è",
  "1147": "vat",
  "1148": " ty",
  "1149": " gr",
  "1150": " din",
  "1151": "ön",
  "1152": " са",
  "1153": " από",
  "1154": " los",
  "1155": " mod",
  "1156": "ene",
  "1157": " бы",
  "1158": "itu",
  "1159": " но",
  "1160": "led",
  "1161": " Det",
  "1162": "ού",
  "1163": "use",
  "1164": " bet",
  "1165": " este",
  "1166": "ря",
  "1167": " зна",
  "1168": " την",
  "1169": " St",
  "1170": " ut",
  "1171": "enn",
  "1172": " pi",
  "1173": " ze",
  "1174": "uk",
  "1175": "este",
  "1176": "zn",
  "1177": " mar",
  "1178": "ного",
  "1179": " ре",
  "1180": " you",
  "1181": " till",
  "1182": " Q",
  "1183": "ione",
  "1184": "či",
  "1185": " han",
  "1186": "inu",
  "1187": " tas",
  "1188": "pu",
  "1189": "ink",
  "1190": "itt",
  "1191": " ak",
  "1192": " dan",
  "1193": " раз",
  "1194": " pour",
  "1195": " це",
  "1196": " hab",
  "1197": " tod",
  "1198": "äh",
  "1199": "chen",
  "1200": "bli",
  "1201": "τά",
  "1202": "tiv",
  "1203": " wir",
  "1204": " imp",
  "1205": "ice",
  "1206": "zz",
  "1207": "пи",
  "1208": "eri",
  "1209": " sch",
  "1210": " ti",
  "1211": " ju",
  "1212": " ot",
  "1213": " tik",
  "1214": "isi",
  "1215": " со",
  "1216": "iek",
  "1217": "entru",
  "1218": " jag",
  "1219": "yn",
  "1220": " dob",
  "1221": "enti",
  "1222": "рі",
  "1223": " så",
  "1224": "ima",
  "1225": " χ",
  "1226": "ert",
  "1227": " raz",
  "1228": "ied",
  "1229": "wo",
  "1230": "ime",
  "1231": "ino",
  "1232": " pat",
  "1233": " że",
  "1234": "ρά",
  "1235": "ту",
  "1236": "ose",
  "1237": " kur",
  "1238": " pal",
  "1239": "her",
  "1240": "tion",
  "1241": " võ",
  "1242": " bil",
  "1243": " ва",
  "1244": "ουν",
  "1245": " No",
  "1246": " nek",
  "1247": "še",
  "1248": "we",
  "1249": " inte",
  "1250": " ved",
  "1251": " sav",
  "1252": "ger",
  "1253": " Я",
  "1254": " see",
  "1255": "ken",
  "1256": "ši",
  "1257": " Ch",
  "1258": "ema",
  "1259": " А",
  "1260": "άν",
  "1261": " jeg",
  "1262": "pi",
  "1263": " fa",
  "1264": " mai",
  "1265": "eni",
  "1266": " ga",
  "1267": "ide",
  "1268": "сть",
  "1269": " ste",
  "1270": "пе",
  "1271": " συ",
  "1272": "les",
  "1273": "ux",
  "1274": " sta",
  "1275": "ін",
  "1276": " nad",
  "1277": "ės",
  "1278": " як",
  "1279": "val",
  "1280": "ém",
  "1281": "emm",
  "1282": " uh",
  "1283": " br",
  "1284": " js",
  "1285": " zijn",
  "1286": "inen",
  "1287": " las",
  "1288": "var",
  "1289": " care",
  "1290": "nu",
  "1291": "usi",
  "1292": "amente",
  "1293": "pre",
  "1294": " επ",
  "1295": " вы",
  "1296": "ää",
  "1297": "unk",
  "1298": "ike",
  "1299": "het",
  "1300": " ten",
  "1301": " sie",
  "1302": "ться",
  "1303": "ía",
  "1304": "ür",
  "1305": " An",
  "1306": " dom",
  "1307": "tig",
  "1308": "ser",
  "1309": " La",
  "1310": "tre",
  "1311": "amos",
  "1312": " τα",
  "1313": " tro",
  "1314": " non",
  "1315": " q",
  "1316": " fi",
  "1317": "man",
  "1318": "ги",
  "1319": " pentru",
  "1320": "ισ",
  "1321": " bo",
  "1322": " съ",
  "1323": "ρε",
  "1324": " η",
  "1325": "up",
  "1326": " kol",
  "1327": "ži",
  "1328": "ām",
  "1329": " aby",
  "1330": " gen",
  "1331": " tam",
  "1332": "ova",
  "1333": " Le",
  "1334": "ese",
  "1335": " Α",
  "1336": " wh",
  "1337": "ove",
  "1338": "ολ",
  "1339": " Sie",
  "1340": " β",
  "1341": "лі",
  "1342": " ф",
  "1343": "imo",
  "1344": "vis",
  "1345": " une",
  "1346": "ρό",
  "1347": " wa",
  "1348": "ně",
  "1349": "ott",
  "1350": " jak",
  "1351": " бе",
  "1352": " fu",
  "1353": "eta",
  "1354": "van",
  "1355": "ét",
  "1356": "uma",
  "1357": " nä",
  "1358": "uj",
  "1359": " Vi",
  "1360": "esta",
  "1361": " fo",
  "1362": " ikke",
  "1363": " kien",
  "1364": "mente",
  "1365": " може",
  "1366": " ни",
  "1367": "ums",
  "1368": " että",
  "1369": " hän",
  "1370": "ije",
  "1371": " nos",
  "1372": "ige",
  "1373": "āk",
  "1374": " как",
  "1375": " vien",
  "1376": "sta",
  "1377": " mil",
  "1378": "ero",
  "1379": "ці",
  "1380": " reg",
  "1381": "lj",
  "1382": " Qu",
  "1383": "ого",
  "1384": "oli",
  "1385": " jest",
  "1386": "cie",
  "1387": "esto",
  "1388": " over",
  "1389": "af",
  "1390": " хо",
  "1391": " φ",
  "1392": " αυτ",
  "1393": " στο",
  "1394": "joni",
  "1395": " dru",
  "1396": "ται",
  "1397": " aut",
  "1398": "σε",
  "1399": " voor",
  "1400": " mal",
  "1401": "pt",
  "1402": "ras",
  "1403": "ån",
  "1404": "eme",
  "1405": "ła",
  "1406": "cion",
  "1407": " Na",
  "1408": " vous",
  "1409": " wer",
  "1410": "urs",
  "1411": "ør",
  "1412": "ры",
  "1413": "ick",
  "1414": "cê",
  "1415": " nas",
  "1416": " ö",
  "1417": "ção",
  "1418": " kr",
  "1419": "ena",
  "1420": "ха",
  "1421": " uma",
  "1422": " vai",
  "1423": "hom",
  "1424": " ind",
  "1425": " все",
  "1426": " zn",
  "1427": " como",
  "1428": "ins",
  "1429": "ende",
  "1430": " mor",
  "1431": "ере",
  "1432": " това",
  "1433": " als",
  "1434": "ταν",
  "1435": "ely",
  "1436": " svo",
  "1437": " ud",
  "1438": "tó",
  "1439": " vel",
  "1440": "пра",
  "1441": " us",
  "1442": "zen",
  "1443": "hn",
  "1444": "ción",
  "1445": " Б",
  "1446": " vil",
  "1447": "ps",
  "1448": " naj",
  "1449": "une",
  "1450": " yra",
  "1451": " x",
  "1452": " roz",
  "1453": "мен",
  "1454": " ktor",
  "1455": " go",
  "1456": "wi",
  "1457": "aks",
  "1458": "ella",
  "1459": " probl",
  "1460": "ity",
  "1461": " θα",
  "1462": " bar",
  "1463": "са",
  "1464": "σει",
  "1465": " mais",
  "1466": " αν",
  "1467": " То",
  "1468": " sl",
  "1469": " comp",
  "1470": " não",
  "1471": "wn",
  "1472": "ive",
  "1473": " von",
  "1474": " qui",
  "1475": "vel",
  "1476": "lich",
  "1477": "nosti",
  "1478": "min",
  "1479": " war",
  "1480": "uje",
  "1481": " niet",
  "1482": " ή",
  "1483": "ιο",
  "1484": "iau",
  "1485": "ään",
  "1486": "ým",
  "1487": "μέ",
  "1488": "ament",
  "1489": "ole",
  "1490": " sin",
  "1491": " not",
  "1492": " Ar",
  "1493": " pom",
  "1494": " vor",
  "1495": "āt",
  "1496": "por",
  "1497": " bud",
  "1498": " wy",
  "1499": "ба",
  "1500": "isti",
  "1501": " aj",
  "1502": " The",
  "1503": " tur",
  "1504": " sur",
  "1505": "ят",
  "1506": "jet",
  "1507": "gan",
  "1508": " Ε",
  "1509": " kor",
  "1510": "iex",
  "1511": " nicht",
  "1512": " dal",
  "1513": "ρί",
  "1514": "eld",
  "1515": "іль",
  "1516": "let",
  "1517": " kar",
  "1518": " dr",
  "1519": "uri",
  "1520": "by",
  "1521": "iden",
  "1522": "ern",
  "1523": " ako",
  "1524": " σε",
  "1525": "că",
  "1526": "bil",
  "1527": " dans",
  "1528": "utta",
  "1529": "asta",
  "1530": " sm",
  "1531": "ret",
  "1532": " λ",
  "1533": "ido",
  "1534": "age",
  "1535": " her",
  "1536": " προ",
  "1537": " mas",
  "1538": "inn",
  "1539": " бо",
  "1540": " dass",
  "1541": " пра",
  "1542": "kom",
  "1543": " З",
  "1544": " mat",
  "1545": " kā",
  "1546": " El",
  "1547": " від",
  "1548": "ší",
  "1549": " wie",
  "1550": "pro",
  "1551": " tar",
  "1552": " tud",
  "1553": " ca",
  "1554": "kon",
  "1555": " πε",
  "1556": " па",
  "1557": "lim",
  "1558": " bes",
  "1559": " kai",
  "1560": "ros",
  "1561": " для",
  "1562": " pred",
  "1563": "ву",
  "1564": "νε",
  "1565": " era",
  "1566": " ave",
  "1567": " bū",
  "1568": "nik",
  "1569": "ith",
  "1570": " któ",
  "1571": "ors",
  "1572": "щи",
  "1573": " ста",
  "1574": " tom",
  "1575": " mus",
  "1576": " gal",
  "1577": "cer",
  "1578": "tt",
  "1579": " Š",
  "1580": " leg",
  "1581": "rij",
  "1582": " Τ",
  "1583": " Euro",
  "1584": " Tai",
  "1585": "form",
  "1586": " ст",
  "1587": " ме",
  "1588": " div",
  "1589": "ον",
  "1590": " ду",
  "1591": "ска",
  "1592": " fl",
  "1593": " auf",
  "1594": " cons",
  "1595": " ci",
  "1596": " так",
  "1597": "ket",
  "1598": " kö",
  "1599": " ali",
  "1600": " dos",
  "1601": "ουμε",
  "1602": "vad",
  "1603": " str",
  "1604": "itä",
  "1605": "ase",
  "1606": " nog",
  "1607": "ann",
  "1608": "лен",
  "1609": "fic",
  "1610": " υ",
  "1611": "fer",
  "1612": " Κ",
  "1613": " сво",
  "1614": "elo",
  "1615": "ec",
  "1616": "pos",
  "1617": " sen",
  "1618": " nous",
  "1619": " Com",
  "1620": " ли",
  "1621": "зо",
  "1622": " sim",
  "1623": " más",
  "1624": " δεν",
  "1625": " Po",
  "1626": "īb",
  "1627": " gl",
  "1628": " prog",
  "1629": "ekk",
  "1630": "ure",
  "1631": " πα",
  "1632": "ски",
  "1633": " sc",
  "1634": " tri",
  "1635": " sob",
  "1636": " kui",
  "1637": " ag",
  "1638": "kun",
  "1639": " bl",
  "1640": " ще",
  "1641": "ών",
  "1642": " hm",
  "1643": "ρέ",
  "1644": "cy",
  "1645": "tim",
  "1646": " ji",
  "1647": " have",
  "1648": "alo",
  "1649": " ole",
  "1650": "ól",
  "1651": "vet",
  "1652": "rt",
  "1653": " Tak",
  "1654": " person",
  "1655": " ча",
  "1656": " tagħ",
  "1657": "asi",
  "1658": " στη",
  "1659": "šan",
  "1660": "zd",
  "1661": " fel",
  "1662": " inc",
  "1663": "EE",
  "1664": "λο",
  "1665": " ένα",
  "1666": " ве",
  "1667": " você",
  "1668": " mig",
  "1669": " už",
  "1670": "ща",
  "1671": " Mar",
  "1672": "ág",
  "1673": " heb",
  "1674": "ēs",
  "1675": " vä",
  "1676": " Da",
  "1677": " bol",
  "1678": " ih",
  "1679": "ści",
  "1680": "vor",
  "1681": "št",
  "1682": "λα",
  "1683": " sus",
  "1684": "ker",
  "1685": " cs",
  "1686": " kter",
  "1687": "uld",
  "1688": "eks",
  "1689": " nes",
  "1690": "сно",
  "1691": "bb",
  "1692": "ava",
  "1693": " alle",
  "1694": " Par",
  "1695": "war",
  "1696": "ēj",
  "1697": "iko",
  "1698": "rad",
  "1699": "nost",
  "1700": " pla",
  "1701": "yl",
  "1702": "par",
  "1703": "ovan",
  "1704": "ân",
  "1705": " dé",
  "1706": " vers",
  "1707": "nak",
  "1708": " vide",
  "1709": " eu",
  "1710": "ette",
  "1711": " cer",
  "1712": "lik",
  "1713": "мі",
  "1714": " are",
  "1715": "oni",
  "1716": "ák",
  "1717": " ou",
  "1718": " pov",
  "1719": "hed",
  "1720": " ah",
  "1721": "gel",
  "1722": "hen",
  "1723": "ło",
  "1724": "ак",
  "1725": "hu",
  "1726": "ний",
  "1727": "ün",
  "1728": "ss",
  "1729": " don",
  "1730": "це",
  "1731": " hat",
  "1732": "κε",
  "1733": " х",
  "1734": " nov",
  "1735": "hat",
  "1736": "imi",
  "1737": " mind",
  "1738": " tiegħ",
  "1739": " buvo",
  "1740": " inv",
  "1741": "oc",
  "1742": "ner",
  "1743": " car",
  "1744": "λε",
  "1745": "él",
  "1746": " produ",
  "1747": "kol",
  "1748": "ados",
  "1749": " tä",
  "1750": "fter",
  "1751": " gro",
  "1752": " Be",
  "1753": "nej",
  "1754": "yst",
  "1755": "almente",
  "1756": " Σ",
  "1757": " plus",
  "1758": " Pro",
  "1759": "жно",
  "1760": "áz",
  "1761": "ekt",
  "1762": "бе",
  "1763": " mer",
  "1764": "nes",
  "1765": " pie",
  "1766": " τι",
  "1767": "asti",
  "1768": "ните",
  "1769": " Te",
  "1770": "agy",
  "1771": " ć",
  "1772": " mog",
  "1773": " ба",
  "1774": "ulle",
  "1775": "its",
  "1776": "ativ",
  "1777": "oti",
  "1778": "my",
  "1779": " τον",
  "1780": "ats",
  "1781": "льно",
  "1782": " По",
  "1783": "ona",
  "1784": " pres",
  "1785": "kel",
  "1786": " кото",
  "1787": " Ale",
  "1788": " aan",
  "1789": " пере",
  "1790": "rem",
  "1791": " wi",
  "1792": "ingap",
  "1793": "су",
  "1794": "āj",
  "1795": "ità",
  "1796": " id",
  "1797": "yv",
  "1798": " Е",
  "1799": "ingen",
  "1800": " мен",
  "1801": "лед",
  "1802": "ater",
  "1803": "ue",
  "1804": " tran",
  "1805": " Me",
  "1806": "σι",
  "1807": " oma",
  "1808": "ilo",
  "1809": " Π",
  "1810": " sol",
  "1811": " dig",
  "1812": "ство",
  "1813": " Jo",
  "1814": "ор",
  "1815": "ah",
  "1816": " eller",
  "1817": " Sch",
  "1818": "ша",
  "1819": "oč",
  "1820": " μα",
  "1821": " под",
  "1822": "oz",
  "1823": "λη",
  "1824": " prin",
  "1825": " kl",
  "1826": "τή",
  "1827": " лю",
  "1828": "ско",
  "1829": " biex",
  "1830": " eine",
  "1831": " ré",
  "1832": "чно",
  "1833": " dz",
  "1834": "emos",
  "1835": "akt",
  "1836": "ær",
  "1837": " dire",
  "1838": "ass",
  "1839": " għal",
  "1840": " up",
  "1841": "emb",
  "1842": " We",
  "1843": " dol",
  "1844": "jer",
  "1845": " έχ",
  "1846": "μο",
  "1847": "ura",
  "1848": " bija",
  "1849": " mon",
  "1850": " lai",
  "1851": " На",
  "1852": "esso",
  "1853": " Er",
  "1854": "cij",
  "1855": "iste",
  "1856": " én",
  "1857": " nap",
  "1858": "šk",
  "1859": "гу",
  "1860": "ysl",
  "1861": "сте",
  "1862": "ého",
  "1863": "ěl",
  "1864": " kap",
  "1865": "anti",
  "1866": " cor",
  "1867": "kr",
  "1868": " with",
  "1869": " Μ",
  "1870": "ong",
  "1871": " cre",
  "1872": "зу",
  "1873": "ande",
  "1874": "ív",
  "1875": " rec",
  "1876": " He",
  "1877": "ργ",
  "1878": " star",
  "1879": "νη",
  "1880": " zd",
  "1881": " tā",
  "1882": "czy",
  "1883": "hod",
  "1884": " ny",
  "1885": "cs",
  "1886": " cz",
  "1887": "ald",
  "1888": " У",
  "1889": " što",
  "1890": "ný",
  "1891": "ēr",
  "1892": "pli",
  "1893": " poz",
  "1894": " pop",
  "1895": " int",
  "1896": "ach",
  "1897": "ijiet",
  "1898": "anto",
  "1899": " Ich",
  "1900": " sich",
  "1901": "ome",
  "1902": "enta",
  "1903": " come",
  "1904": " kä",
  "1905": " sab",
  "1906": " bli",
  "1907": " app",
  "1908": "ád",
  "1909": " pon",
  "1910": "ем",
  "1911": "elen",
  "1912": "vol",
  "1913": " przy",
  "1914": " naš",
  "1915": "ais",
  "1916": "ând",
  "1917": " cam",
  "1918": "ння",
  "1919": " lah",
  "1920": " Ik",
  "1921": "åg",
  "1922": " Oh",
  "1923": " had",
  "1924": " mag",
  "1925": "rie",
  "1926": " κά",
  "1927": "λλά",
  "1928": " nav",
  "1929": "ły",
  "1930": "ρω",
  "1931": "ρη",
  "1932": " mill",
  "1933": "pri",
  "1934": " kont",
  "1935": "ří",
  "1936": " nor",
  "1937": " Men",
  "1938": " esta",
  "1939": " zo",
  "1940": " maj",
  "1941": "вер",
  "1942": " ru",
  "1943": "des",
  "1944": " zap",
  "1945": " sag",
  "1946": " pou",
  "1947": " дру",
  "1948": " Ta",
  "1949": " би",
  "1950": " Ο",
  "1951": "fi",
  "1952": " für",
  "1953": " vý",
  "1954": "ėl",
  "1955": " aus",
  "1956": "yk",
  "1957": " Jag",
  "1958": "fe",
  "1959": " ά",
  "1960": " So",
  "1961": " kell",
  "1962": "eti",
  "1963": "ull",
  "1964": "зна",
  "1965": " dit",
  "1966": " пред",
  "1967": "anie",
  "1968": "κα",
  "1969": " gra",
  "1970": "ties",
  "1971": " sel",
  "1972": "ams",
  "1973": "mis",
  "1974": " this",
  "1975": "endo",
  "1976": " And",
  "1977": " pak",
  "1978": " zá",
  "1979": "hi",
  "1980": " gu",
  "1981": " ur",
  "1982": "hd",
  "1983": " ger",
  "1984": " nat",
  "1985": " tot",
  "1986": "ení",
  "1987": " μια",
  "1988": "olog",
  "1989": " й",
  "1990": " Re",
  "1991": " hal",
  "1992": "zu",
  "1993": "ijo",
  "1994": " vir",
  "1995": " pad",
  "1996": " αυτό",
  "1997": "una",
  "1998": "su",
  "1999": "net",
  "2000": "пу",
  "2001": " fra",
  "2002": "mes",
  "2003": "land",
  "2004": " мы",
  "2005": " Vo",
  "2006": "ді",
  "2007": "osa",
  "2008": " É",
  "2009": " out",
  "2010": "osta",
  "2011": " Nu",
  "2012": "kö",
  "2013": "ades",
  "2014": "iten",
  "2015": "oma",
  "2016": " ie",
  "2017": " kõ",
  "2018": "cis",
  "2019": " let",
  "2020": " huwa",
  "2021": " kam",
  "2022": " vr",
  "2023": " cas",
  "2024": " sal",
  "2025": " god",
  "2026": "ová",
  "2027": " Ко",
  "2028": "anje",
  "2029": "wie",
  "2030": "esz",
  "2031": "lä",
  "2032": " está",
  "2033": " sono",
  "2034": " mes",
  "2035": "вати",
  "2036": "ului",
  "2037": "mas",
  "2038": "yd",
  "2039": "ъл",
  "2040": " ker",
  "2041": "ev",
  "2042": " има",
  "2043": " fost",
  "2044": "als",
  "2045": " или",
  "2046": "гра",
  "2047": " cel",
  "2048": " просто",
  "2049": " Р",
  "2050": " Pr",
  "2051": " mom",
  "2052": "ēl",
  "2053": " kuri",
  "2054": "xx",
  "2055": " tö",
  "2056": "oka",
  "2057": " bez",
  "2058": "жу",
  "2059": " can",
  "2060": " ide",
  "2061": " má",
  "2062": "ná",
  "2063": "ii",
  "2064": "ça",
  "2065": "iku",
  "2066": "лко",
  "2067": " Ha",
  "2068": "ната",
  "2069": " ш",
  "2070": " dok",
  "2071": " Singap",
  "2072": "сі",
  "2073": "στε",
  "2074": "ych",
  "2075": "ény",
  "2076": "gs",
  "2077": "ēt",
  "2078": " ő",
  "2079": "nih",
  "2080": " δια",
  "2081": "oro",
  "2082": " Het",
  "2083": " Jeg",
  "2084": "mit",
  "2085": "ew",
  "2086": "bar",
  "2087": "udz",
  "2088": " wor",
  "2089": "ът",
  "2090": " oc",
  "2091": "ći",
  "2092": " lab",
  "2093": "ico",
  "2094": " жи",
  "2095": "ores",
  "2096": " ez",
  "2097": " ov",
  "2098": " ї",
  "2099": "ble",
  "2100": "jud",
  "2101": "elj",
  "2102": " ai",
  "2103": "cent",
  "2104": " neg",
  "2105": " parti",
  "2106": " Die",
  "2107": "rol",
  "2108": " minn",
  "2109": " μπο",
  "2110": " tut",
  "2111": "ρχ",
  "2112": " cap",
  "2113": "гда",
  "2114": " volt",
  "2115": " Но",
  "2116": " prof",
  "2117": " seda",
  "2118": "sch",
  "2119": " pen",
  "2120": "бы",
  "2121": " gy",
  "2122": "ăr",
  "2123": "дно",
  "2124": "rov",
  "2125": "ania",
  "2126": " beg",
  "2127": "umu",
  "2128": " col",
  "2129": " Г",
  "2130": "rig",
  "2131": "isen",
  "2132": " kat",
  "2133": "lev",
  "2134": " ett",
  "2135": " ně",
  "2136": " nep",
  "2137": "ék",
  "2138": " parte",
  "2139": "pen",
  "2140": " ġ",
  "2141": " polit",
  "2142": "iej",
  "2143": "ād",
  "2144": "ty",
  "2145": "ρώ",
  "2146": "br",
  "2147": " vš",
  "2148": " ok",
  "2149": "бу",
  "2150": " son",
  "2151": "σα",
  "2152": "ată",
  "2153": "θε",
  "2154": "ajo",
  "2155": " ξ",
  "2156": " sú",
  "2157": "ιά",
  "2158": " væ",
  "2159": " väl",
  "2160": " kot",
  "2161": " alla",
  "2162": " jako",
  "2163": "lad",
  "2164": " fac",
  "2165": "ħal",
  "2166": " fuq",
  "2167": " nar",
  "2168": " še",
  "2169": " мі",
  "2170": " jsem",
  "2171": " živ",
  "2172": "issa",
  "2173": " μέ",
  "2174": " prze",
  "2175": "del",
  "2176": " Is",
  "2177": " ele",
  "2178": " dur",
  "2179": " като",
  "2180": "szy",
  "2181": " Ir",
  "2182": " inst",
  "2183": "жда",
  "2184": "чен",
  "2185": " ned",
  "2186": "afna",
  "2187": "ola",
  "2188": "īt",
  "2189": "ère",
  "2190": "igen",
  "2191": " ná",
  "2192": "ank",
  "2193": " import",
  "2194": " ну",
  "2195": "gl",
  "2196": "πε",
  "2197": " є",
  "2198": " mõ",
  "2199": "osti",
  "2200": "об",
  "2201": " των",
  "2202": "ете",
  "2203": "ovor",
  "2204": "uv",
  "2205": "els",
  "2206": "eto",
  "2207": " rel",
  "2208": "ют",
  "2209": "emo",
  "2210": " Th",
  "2211": " οι",
  "2212": "eno",
  "2213": " teg",
  "2214": "uni",
  "2215": " tako",
  "2216": " cent",
  "2217": "ité",
  "2218": "cul",
  "2219": " ont",
  "2220": " tag",
  "2221": " Et",
  "2222": " kes",
  "2223": "cho",
  "2224": "tak",
  "2225": "isu",
  "2226": "nek",
  "2227": " ин",
  "2228": "ument",
  "2229": "гато",
  "2230": "каза",
  "2231": " sind",
  "2232": "дин",
  "2233": " Så",
  "2234": "τό",
  "2235": " inf",
  "2236": "ца",
  "2237": "áll",
  "2238": "тел",
  "2239": " Č",
  "2240": " Han",
  "2241": "про",
  "2242": "taa",
  "2243": " smo",
  "2244": " lui",
  "2245": "ute",
  "2246": " diff",
  "2247": " part",
  "2248": "bre",
  "2249": "oks",
  "2250": "ēc",
  "2251": " ig",
  "2252": " qed",
  "2253": " кон",
  "2254": "τέ",
  "2255": " pār",
  "2256": " spe",
  "2257": "ті",
  "2258": "ġġ",
  "2259": "eten",
  "2260": " много",
  "2261": " tun",
  "2262": " tv",
  "2263": " alg",
  "2264": "ée",
  "2265": "ance",
  "2266": "nych",
  "2267": "aju",
  "2268": " mol",
  "2269": " sobre",
  "2270": "lus",
  "2271": " pok",
  "2272": " tim",
  "2273": "ány",
  "2274": "ally",
  "2275": "isten",
  "2276": " må",
  "2277": " Ц",
  "2278": " kommer",
  "2279": " μου",
  "2280": "kov",
  "2281": " has",
  "2282": " ¿",
  "2283": "onom",
  "2284": " uit",
  "2285": "αα",
  "2286": "ns",
  "2287": " πολ",
  "2288": "iec",
  "2289": " dv",
  "2290": " jūs",
  "2291": " vagy",
  "2292": "ść",
  "2293": " Э",
  "2294": "old",
  "2295": " въ",
  "2296": "cial",
  "2297": " роз",
  "2298": " ти",
  "2299": "ire",
  "2300": "ip",
  "2301": "erg",
  "2302": "iks",
  "2303": " vl",
  "2304": " mūs",
  "2305": " bij",
  "2306": " εν",
  "2307": " dies",
  "2308": " isso",
  "2309": "ijk",
  "2310": " mul",
  "2311": " στην",
  "2312": " Ez",
  "2313": " lahko",
  "2314": " mož",
  "2315": " Du",
  "2316": "hl",
  "2317": "ět",
  "2318": " Не",
  "2319": " Ș",
  "2320": "gt",
  "2321": " ví",
  "2322": "zer",
  "2323": " ska",
  "2324": " dra",
  "2325": " seg",
  "2326": " Х",
  "2327": "our",
  "2328": " geb",
  "2329": " sunt",
  "2330": " nam",
  "2331": "owa",
  "2332": " tek",
  "2333": "ved",
  "2334": "ства",
  "2335": "ões",
  "2336": " It",
  "2337": " gran",
  "2338": " program",
  "2339": " ant",
  "2340": "aire",
  "2341": "ност",
  "2342": " Si",
  "2343": " See",
  "2344": "σω",
  "2345": "vu",
  "2346": " end",
  "2347": " hij",
  "2348": " Έ",
  "2349": "lij",
  "2350": "iał",
  "2351": " Î",
  "2352": "iment",
  "2353": " ħafna",
  "2354": "rod",
  "2355": " ass",
  "2356": "aliz",
  "2357": "mel",
  "2358": "ята",
  "2359": " fol",
  "2360": "sti",
  "2361": "vid",
  "2362": " haben",
  "2363": " Mo",
  "2364": " della",
  "2365": " più",
  "2366": "forma",
  "2367": "ös",
  "2368": " Man",
  "2369": "ude",
  "2370": "ligt",
  "2371": "ето",
  "2372": " απο",
  "2373": "μά",
  "2374": "met",
  "2375": "emp",
  "2376": "assa",
  "2377": "cí",
  "2378": " нас",
  "2379": "жен",
  "2380": " upp",
  "2381": " kuid",
  "2382": "inā",
  "2383": " Η",
  "2384": " poč",
  "2385": "pad",
  "2386": "pres",
  "2387": "lar",
  "2388": " fam",
  "2389": "сли",
  "2390": "yb",
  "2391": "aka",
  "2392": "mar",
  "2393": " taip",
  "2394": "ран",
  "2395": "πα",
  "2396": "τί",
  "2397": "них",
  "2398": "ets",
  "2399": "ings",
  "2400": "avo",
  "2401": "οι",
  "2402": " finan",
  "2403": "yti",
  "2404": "ition",
  "2405": " As",
  "2406": "uks",
  "2407": " περι",
  "2408": "ämä",
  "2409": " alt",
  "2410": " ris",
  "2411": "té",
  "2412": "ira",
  "2413": " Und",
  "2414": "ton",
  "2415": " lä",
  "2416": "ren",
  "2417": "ider",
  "2418": "вы",
  "2419": " Og",
  "2420": " gan",
  "2421": "aten",
  "2422": "čno",
  "2423": " efter",
  "2424": " спо",
  "2425": " fe",
  "2426": " dev",
  "2427": "now",
  "2428": "entes",
  "2429": "ные",
  "2430": " vez",
  "2431": "usta",
  "2432": "uto",
  "2433": " rad",
  "2434": " pun",
  "2435": "koll",
  "2436": " Est",
  "2437": " dost",
  "2438": "спо",
  "2439": " akt",
  "2440": " oh",
  "2441": " вре",
  "2442": " under",
  "2443": "зва",
  "2444": " Л",
  "2445": " Im",
  "2446": " sku",
  "2447": "кий",
  "2448": " sil",
  "2449": " которы",
  "2450": " sua",
  "2451": "ars",
  "2452": " Да",
  "2453": " ost",
  "2454": "ээ",
  "2455": "elu",
  "2456": "ria",
  "2457": " hel",
  "2458": " kos",
  "2459": " kaip",
  "2460": " għand",
  "2461": "ioni",
  "2462": "jih",
  "2463": " ня",
  "2464": " net",
  "2465": " pap",
  "2466": " prost",
  "2467": "ты",
  "2468": "ють",
  "2469": " mēs",
  "2470": " här",
  "2471": "tek",
  "2472": " Am",
  "2473": "igt",
  "2474": "vē",
  "2475": "üü",
  "2476": " jos",
  "2477": "tait",
  "2478": " І",
  "2479": " hav",
  "2480": "шо",
  "2481": "reb",
  "2482": " pag",
  "2483": "ходи",
  "2484": "rid",
  "2485": " naar",
  "2486": " prav",
  "2487": "orn",
  "2488": " mot",
  "2489": "ίν",
  "2490": "cha",
  "2491": "ral",
  "2492": " continu",
  "2493": "ld",
  "2494": " far",
  "2495": " stud",
  "2496": " ess",
  "2497": " Ver",
  "2498": " он",
  "2499": "ības",
  "2500": "ėj",
  "2501": "ėjo",
  "2502": "kin",
  "2503": " kra",
  "2504": " avec",
  "2505": "εια",
  "2506": "raz",
  "2507": " problem",
  "2508": " ήταν",
  "2509": "σο",
  "2510": "pet",
  "2511": "ръ",
  "2512": "γμα",
  "2513": " organ",
  "2514": " vu",
  "2515": "ils",
  "2516": "чу",
  "2517": "azz",
  "2518": "дна",
  "2519": " pä",
  "2520": " len",
  "2521": " рабо",
  "2522": "če",
  "2523": "ätt",
  "2524": "ρεί",
  "2525": " werden",
  "2526": "ume",
  "2527": "ито",
  "2528": "arb",
  "2529": " jis",
  "2530": " they",
  "2531": "ín",
  "2532": " dec",
  "2533": "вори",
  "2534": " сто",
  "2535": " daug",
  "2536": " plan",
  "2537": " savo",
  "2538": "illa",
  "2539": " maar",
  "2540": "ès",
  "2541": " vad",
  "2542": "ilor",
  "2543": "ub",
  "2544": " qual",
  "2545": "gal",
  "2546": "hal",
  "2547": "вно",
  "2548": "кти",
  "2549": " су",
  "2550": " ди",
  "2551": "ack",
  "2552": " koji",
  "2553": "ική",
  "2554": "вен",
  "2555": " wo",
  "2556": " also",
  "2557": " någ",
  "2558": "lan",
  "2559": " За",
  "2560": " кра",
  "2561": " są",
  "2562": " Ч",
  "2563": " Den",
  "2564": " sme",
  "2565": " bed",
  "2566": " він",
  "2567": " zv",
  "2568": "вя",
  "2569": "get",
  "2570": " Viņ",
  "2571": "osi",
  "2572": "cip",
  "2573": " під",
  "2574": " stran",
  "2575": " hun",
  "2576": " tid",
  "2577": " Bet",
  "2578": "jeg",
  "2579": " õ",
  "2580": "cess",
  "2581": "raw",
  "2582": "ден",
  "2583": " които",
  "2584": "ных",
  "2585": " Kom",
  "2586": "mon",
  "2587": "oda",
  "2588": " Och",
  "2589": "irm",
  "2590": "jn",
  "2591": "ép",
  "2592": "area",
  "2593": "θη",
  "2594": " bien",
  "2595": " huma",
  "2596": "ovi",
  "2597": " kok",
  "2598": "essa",
  "2599": "ša",
  "2600": " ši",
  "2601": " hebben",
  "2602": " ba",
  "2603": "bol",
  "2604": " mak",
  "2605": " ști",
  "2606": "ska",
  "2607": "ész",
  "2608": "čin",
  "2609": " така",
  "2610": "hm",
  "2611": " prz",
  "2612": " sein",
  "2613": " siis",
  "2614": "vil",
  "2615": "ją",
  "2616": "λά",
  "2617": " put",
  "2618": "ua",
  "2619": " Ν",
  "2620": "ünk",
  "2621": " situ",
  "2622": "ей",
  "2623": "пре",
  "2624": " ін",
  "2625": " sell",
  "2626": "alla",
  "2627": "yslím",
  "2628": " sau",
  "2629": " ле",
  "2630": "wer",
  "2631": "isto",
  "2632": "pod",
  "2633": " enc",
  "2634": " New",
  "2635": " čas",
  "2636": "rar",
  "2637": "if",
  "2638": "rá",
  "2639": " bilo",
  "2640": "šu",
  "2641": " ven",
  "2642": "ee",
  "2643": "ρού",
  "2644": " буде",
  "2645": "тя",
  "2646": "leg",
  "2647": "esi",
  "2648": " му",
  "2649": " num",
  "2650": "πά",
  "2651": " pens",
  "2652": " hija",
  "2653": " samo",
  "2654": " selle",
  "2655": " sec",
  "2656": " like",
  "2657": " bom",
  "2658": "elf",
  "2659": "вля",
  "2660": "ért",
  "2661": " veľ",
  "2662": "tų",
  "2663": "vit",
  "2664": " Δ",
  "2665": "pon",
  "2666": "ță",
  "2667": "ük",
  "2668": " беше",
  "2669": "ât",
  "2670": "fin",
  "2671": " szer",
  "2672": " πο",
  "2673": "any",
  "2674": " Nie",
  "2675": "iga",
  "2676": " uns",
  "2677": " gru",
  "2678": " one",
  "2679": " пос",
  "2680": "χε",
  "2681": " but",
  "2682": "jed",
  "2683": "isa",
  "2684": " jot",
  "2685": "йте",
  "2686": " kön",
  "2687": " quando",
  "2688": "oi",
  "2689": " kal",
  "2690": " wat",
  "2691": " nost",
  "2692": " post",
  "2693": " Um",
  "2694": " sul",
  "2695": " nagy",
  "2696": " xi",
  "2697": " waar",
  "2698": "los",
  "2699": "sten",
  "2700": "esse",
  "2701": " tap",
  "2702": " sak",
  "2703": "anja",
  "2704": " Ze",
  "2705": "amento",
  "2706": "πει",
  "2707": "ają",
  "2708": " gre",
  "2709": " questo",
  "2710": "și",
  "2711": " Ali",
  "2712": " ку",
  "2713": " vet",
  "2714": "uden",
  "2715": " sn",
  "2716": "idu",
  "2717": " nej",
  "2718": "dzie",
  "2719": "ís",
  "2720": "ivers",
  "2721": " pog",
  "2722": " čo",
  "2723": "izz",
  "2724": "tai",
  "2725": " εκ",
  "2726": " ljud",
  "2727": " će",
  "2728": "τικό",
  "2729": " form",
  "2730": " taj",
  "2731": "cio",
  "2732": "indi",
  "2733": "ll",
  "2734": " sub",
  "2735": " чтобы",
  "2736": "vez",
  "2737": " gar",
  "2738": " най",
  "2739": "ish",
  "2740": " nik",
  "2741": "istä",
  "2742": "erd",
  "2743": " vz",
  "2744": "ez",
  "2745": " his",
  "2746": "нь",
  "2747": "oval",
  "2748": "λή",
  "2749": " επι",
  "2750": "inti",
  "2751": "ій",
  "2752": " arī",
  "2753": " sont",
  "2754": " щоб",
  "2755": " prie",
  "2756": " liv",
  "2757": " tõ",
  "2758": " moż",
  "2759": " стра",
  "2760": "avad",
  "2761": " ben",
  "2762": "ident",
  "2763": " lid",
  "2764": "īdz",
  "2765": " чи",
  "2766": "ales",
  "2767": "iter",
  "2768": "kal",
  "2769": "odu",
  "2770": " Și",
  "2771": " pass",
  "2772": "ване",
  "2773": "ony",
  "2774": "uste",
  "2775": "emme",
  "2776": "idad",
  "2777": " пла",
  "2778": "jat",
  "2779": "при",
  "2780": "miss",
  "2781": " kv",
  "2782": "ski",
  "2783": " will",
  "2784": " hand",
  "2785": "tra",
  "2786": " дума",
  "2787": " σα",
  "2788": " stor",
  "2789": "fa",
  "2790": " bel",
  "2791": "ăm",
  "2792": "кла",
  "2793": " għall",
  "2794": " hi",
  "2795": " tele",
  "2796": "ché",
  "2797": " kdy",
  "2798": "EEEE",
  "2799": "ється",
  "2800": " did",
  "2801": " Takže",
  "2802": " dist",
  "2803": "λέ",
  "2804": "дя",
  "2805": "ный",
  "2806": "ovat",
  "2807": "ós",
  "2808": "ții",
  "2809": "cija",
  "2810": "tic",
  "2811": " dej",
  "2812": "вите",
  "2813": " cr",
  "2814": "itet",
  "2815": " chi",
  "2816": "zione",
  "2817": " sed",
  "2818": "uss",
  "2819": "nud",
  "2820": " dag",
  "2821": "ations",
  "2822": "seb",
  "2823": " dov",
  "2824": " tan",
  "2825": "cep",
  "2826": "ție",
  "2827": "ίζ",
  "2828": " gi",
  "2829": "čen",
  "2830": " kako",
  "2831": "ωω",
  "2832": "δο",
  "2833": " solo",
  "2834": "waż",
  "2835": " Ho",
  "2836": "iska",
  "2837": " spr",
  "2838": " né",
  "2839": "yr",
  "2840": "φο",
  "2841": "mod",
  "2842": "nom",
  "2843": "kas",
  "2844": " Sp",
  "2845": "hte",
  "2846": " just",
  "2847": "ċċ",
  "2848": "āju",
  "2849": " hist",
  "2850": " å",
  "2851": "ват",
  "2852": " faz",
  "2853": "onn",
  "2854": " тако",
  "2855": "он",
  "2856": " его",
  "2857": " ś",
  "2858": " vra",
  "2859": " ανα",
  "2860": " skulle",
  "2861": " mě",
  "2862": " aqu",
  "2863": " bra",
  "2864": "vä",
  "2865": " know",
  "2866": "lio",
  "2867": "ula",
  "2868": "aja",
  "2869": "сту",
  "2870": " On",
  "2871": " Co",
  "2872": " cin",
  "2873": "alis",
  "2874": " hier",
  "2875": "vir",
  "2876": " asi",
  "2877": "īj",
  "2878": " já",
  "2879": " hát",
  "2880": " sor",
  "2881": "iva",
  "2882": " gener",
  "2883": " mond",
  "2884": "ότε",
  "2885": "lat",
  "2886": "ним",
  "2887": " tul",
  "2888": " hemm",
  "2889": "κό",
  "2890": "ild",
  "2891": " πολύ",
  "2892": " door",
  "2893": "esp",
  "2894": " ook",
  "2895": " joka",
  "2896": " sou",
  "2897": "bor",
  "2898": "zą",
  "2899": " ком",
  "2900": "esch",
  "2901": "ator",
  "2902": " esc",
  "2903": "пер",
  "2904": " wię",
  "2905": " Hän",
  "2906": "γο",
  "2907": " ä",
  "2908": "ovo",
  "2909": " În",
  "2910": " же",
  "2911": " nev",
