program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0b1"}})]
{
    func main<ios17>(tensor<fp32, [?, 1, 160000]> audio) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>>>((("DefaultShapes", {{"audio", [32, 1, 160000]}}), ("EnumeratedShapes", {{"audio_1_1_10_1_160000_", {{"audio", [10, 1, 160000]}}}, {"audio_1_1_11_1_160000_", {{"audio", [11, 1, 160000]}}}, {"audio_1_1_12_1_160000_", {{"audio", [12, 1, 160000]}}}, {"audio_1_1_13_1_160000_", {{"audio", [13, 1, 160000]}}}, {"audio_1_1_14_1_160000_", {{"audio", [14, 1, 160000]}}}, {"audio_1_1_15_1_160000_", {{"audio", [15, 1, 160000]}}}, {"audio_1_1_16_1_160000_", {{"audio", [16, 1, 160000]}}}, {"audio_1_1_17_1_160000_", {{"audio", [17, 1, 160000]}}}, {"audio_1_1_18_1_160000_", {{"audio", [18, 1, 160000]}}}, {"audio_1_1_19_1_160000_", {{"audio", [19, 1, 160000]}}}, {"audio_1_1_1_1_160000_", {{"audio", [1, 1, 160000]}}}, {"audio_1_1_20_1_160000_", {{"audio", [20, 1, 160000]}}}, {"audio_1_1_21_1_160000_", {{"audio", [21, 1, 160000]}}}, {"audio_1_1_22_1_160000_", {{"audio", [22, 1, 160000]}}}, {"audio_1_1_23_1_160000_", {{"audio", [23, 1, 160000]}}}, {"audio_1_1_24_1_160000_", {{"audio", [24, 1, 160000]}}}, {"audio_1_1_25_1_160000_", {{"audio", [25, 1, 160000]}}}, {"audio_1_1_26_1_160000_", {{"audio", [26, 1, 160000]}}}, {"audio_1_1_27_1_160000_", {{"audio", [27, 1, 160000]}}}, {"audio_1_1_28_1_160000_", {{"audio", [28, 1, 160000]}}}, {"audio_1_1_29_1_160000_", {{"audio", [29, 1, 160000]}}}, {"audio_1_1_2_1_160000_", {{"audio", [2, 1, 160000]}}}, {"audio_1_1_30_1_160000_", {{"audio", [30, 1, 160000]}}}, {"audio_1_1_31_1_160000_", {{"audio", [31, 1, 160000]}}}, {"audio_1_1_32_1_160000_", {{"audio", [32, 1, 160000]}}}, {"audio_1_1_3_1_160000_", {{"audio", [3, 1, 160000]}}}, {"audio_1_1_4_1_160000_", {{"audio", [4, 1, 160000]}}}, {"audio_1_1_5_1_160000_", {{"audio", [5, 1, 160000]}}}, {"audio_1_1_6_1_160000_", {{"audio", [6, 1, 160000]}}}, {"audio_1_1_7_1_160000_", {{"audio", [7, 1, 160000]}}}, {"audio_1_1_8_1_160000_", {{"audio", [8, 1, 160000]}}}, {"audio_1_1_9_1_160000_", {{"audio", [9, 1, 160000]}}}})))] {
            tensor<fp32, [1]> sincnet_wav_norm1d_bias = const()[name = tensor<string, []>("sincnet_wav_norm1d_bias"), val = tensor<fp32, [1]>([0x1.73505ep-5])];
            tensor<fp32, [1]> sincnet_wav_norm1d_weight = const()[name = tensor<string, []>("sincnet_wav_norm1d_weight"), val = tensor<fp32, [1]>([0x1.43f862p-7])];
            tensor<fp32, [80]> sincnet_norm1d_0_bias = const()[name = tensor<string, []>("sincnet_norm1d_0_bias"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [80]> sincnet_norm1d_0_weight = const()[name = tensor<string, []>("sincnet_norm1d_0_weight"), val = tensor<fp32, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(448)))];
            tensor<fp32, [60]> sincnet_conv1d_1_bias = const()[name = tensor<string, []>("sincnet_conv1d_1_bias"), val = tensor<fp32, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(832)))];
            tensor<fp32, [60, 80, 5]> sincnet_conv1d_1_weight = const()[name = tensor<string, []>("sincnet_conv1d_1_weight"), val = tensor<fp32, [60, 80, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp32, [60]> sincnet_norm1d_1_bias = const()[name = tensor<string, []>("sincnet_norm1d_1_bias"), val = tensor<fp32, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97216)))];
            tensor<fp32, [60]> sincnet_norm1d_1_weight = const()[name = tensor<string, []>("sincnet_norm1d_1_weight"), val = tensor<fp32, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97536)))];
            tensor<fp32, [60]> sincnet_conv1d_2_bias = const()[name = tensor<string, []>("sincnet_conv1d_2_bias"), val = tensor<fp32, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97856)))];
            tensor<fp32, [60, 60, 5]> sincnet_conv1d_2_weight = const()[name = tensor<string, []>("sincnet_conv1d_2_weight"), val = tensor<fp32, [60, 60, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(98176)))];
            tensor<fp32, [60]> sincnet_norm1d_2_bias = const()[name = tensor<string, []>("sincnet_norm1d_2_bias"), val = tensor<fp32, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170240)))];
            tensor<fp32, [60]> sincnet_norm1d_2_weight = const()[name = tensor<string, []>("sincnet_norm1d_2_weight"), val = tensor<fp32, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170560)))];
            tensor<fp32, [128]> linear_0_bias = const()[name = tensor<string, []>("linear_0_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170880)))];
            tensor<fp32, [128, 256]> linear_0_weight = const()[name = tensor<string, []>("linear_0_weight"), val = tensor<fp32, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(171456)))];
            tensor<fp32, [128]> linear_1_bias = const()[name = tensor<string, []>("linear_1_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(302592)))];
            tensor<fp32, [128, 128]> linear_1_weight = const()[name = tensor<string, []>("linear_1_weight"), val = tensor<fp32, [128, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(303168)))];
            tensor<fp32, [7]> classifier_bias = const()[name = tensor<string, []>("classifier_bias"), val = tensor<fp32, [7]>([-0x1.00e888p+0, 0x1.67cb52p-2, 0x1.3d87fp-1, 0x1.c8aa8p-2, -0x1.445f5ep-2, -0x1.591274p-1, -0x1.8fb70ep-2])];
            tensor<fp32, [7, 128]> classifier_weight = const()[name = tensor<string, []>("classifier_weight"), val = tensor<fp32, [7, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368768)))];
            tensor<fp32, []> var_9 = const()[name = tensor<string, []>("op_9"), val = tensor<fp32, []>(0x1.47ae14p-7)];
            tensor<fp32, []> var_24 = const()[name = tensor<string, []>("op_24"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [?, 1, 160000]> waveform = instance_norm(beta = sincnet_wav_norm1d_bias, epsilon = var_24, gamma = sincnet_wav_norm1d_weight, x = audio)[name = tensor<string, []>("waveform")];
            tensor<fp32, [80, 1, 251]> filters = const()[name = tensor<string, []>("filters"), val = tensor<fp32, [80, 1, 251]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(372416)))];
            tensor<string, []> outputs_pad_type_0 = const()[name = tensor<string, []>("outputs_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> outputs_strides_0 = const()[name = tensor<string, []>("outputs_strides_0"), val = tensor<int32, [1]>([10])];
            tensor<int32, [2]> outputs_pad_0 = const()[name = tensor<string, []>("outputs_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> outputs_dilations_0 = const()[name = tensor<string, []>("outputs_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> outputs_groups_0 = const()[name = tensor<string, []>("outputs_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [?, 80, 15975]> outputs = conv(dilations = outputs_dilations_0, groups = outputs_groups_0, pad = outputs_pad_0, pad_type = outputs_pad_type_0, strides = outputs_strides_0, weight = filters, x = waveform)[name = tensor<string, []>("outputs")];
            tensor<fp32, [?, 80, 15975]> input_1 = abs(x = outputs)[name = tensor<string, []>("input_1")];
            tensor<int32, [1]> var_119 = const()[name = tensor<string, []>("op_119"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, [1]>([3])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, []> input_3_ceil_mode_0 = const()[name = tensor<string, []>("input_3_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [?, 80, 5325]> input_3 = max_pool(ceil_mode = input_3_ceil_mode_0, kernel_sizes = var_119, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_120, x = input_1)[name = tensor<string, []>("input_3")];
            tensor<fp32, [?, 80, 5325]> input_5 = instance_norm(beta = sincnet_norm1d_0_bias, epsilon = var_24, gamma = sincnet_norm1d_0_weight, x = input_3)[name = tensor<string, []>("input_5")];
            tensor<fp32, [?, 80, 5325]> input_7 = leaky_relu(alpha = var_9, x = input_5)[name = tensor<string, []>("input_7")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [?, 60, 5321]> input_9 = conv(bias = sincnet_conv1d_1_bias, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = sincnet_conv1d_1_weight, x = input_7)[name = tensor<string, []>("input_9")];
            tensor<int32, [1]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, [1]>([3])];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, []> input_11_ceil_mode_0 = const()[name = tensor<string, []>("input_11_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [?, 60, 1773]> input_11 = max_pool(ceil_mode = input_11_ceil_mode_0, kernel_sizes = var_135, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = var_136, x = input_9)[name = tensor<string, []>("input_11")];
            tensor<fp32, [?, 60, 1773]> input_13 = instance_norm(beta = sincnet_norm1d_1_bias, epsilon = var_24, gamma = sincnet_norm1d_1_weight, x = input_11)[name = tensor<string, []>("input_13")];
            tensor<fp32, [?, 60, 1773]> input_15 = leaky_relu(alpha = var_9, x = input_13)[name = tensor<string, []>("input_15")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [?, 60, 1769]> input_17 = conv(bias = sincnet_conv1d_2_bias, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = sincnet_conv1d_2_weight, x = input_15)[name = tensor<string, []>("input_17")];
            tensor<int32, [1]> var_151 = const()[name = tensor<string, []>("op_151"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [1]>([3])];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, []> input_19_ceil_mode_0 = const()[name = tensor<string, []>("input_19_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [?, 60, 589]> input_19 = max_pool(ceil_mode = input_19_ceil_mode_0, kernel_sizes = var_151, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = var_152, x = input_17)[name = tensor<string, []>("input_19")];
            tensor<fp32, [?, 60, 589]> input_21 = instance_norm(beta = sincnet_norm1d_2_bias, epsilon = var_24, gamma = sincnet_norm1d_2_weight, x = input_19)[name = tensor<string, []>("input_21")];
            tensor<fp32, [?, 60, 589]> x = leaky_relu(alpha = var_9, x = input_21)[name = tensor<string, []>("x")];
            tensor<int32, [3]> var_163 = const()[name = tensor<string, []>("op_163"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, []> var_172 = const()[name = tensor<string, []>("op_172"), val = tensor<int32, []>(128)];
            tensor<int32, []> var_173 = const()[name = tensor<string, []>("op_173"), val = tensor<int32, []>(8)];
            tensor<fp32, [?, 589, 60]> input_23 = transpose(perm = var_163, x = x)[name = tensor<string, []>("transpose_6")];
            tensor<int32, [3]> var_207_shape = shape(x = input_23)[name = tensor<string, []>("op_207_shape")];
            tensor<int32, []> gather_0_batch_dims_0 = const()[name = tensor<string, []>("gather_0_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> gather_0_validate_indices_0 = const()[name = tensor<string, []>("gather_0_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> select_0 = const()[name = tensor<string, []>("select_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0_axis_1 = const()[name = tensor<string, []>("gather_0_axis_1"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0 = gather(axis = gather_0_axis_1, batch_dims = gather_0_batch_dims_0, indices = select_0, validate_indices = gather_0_validate_indices_0, x = var_207_shape)[name = tensor<string, []>("gather_0")];
            tensor<int32, []> concat_0_axis_0 = const()[name = tensor<string, []>("concat_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_0_interleave_0 = const()[name = tensor<string, []>("concat_0_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (var_173, gather_0, var_172))[name = tensor<string, []>("concat_0")];
            tensor<fp32, []> hx_1_value_0 = const()[name = tensor<string, []>("hx_1_value_0"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, [8, ?, 128]> hx_1 = fill(shape = concat_0, value = hx_1_value_0)[name = tensor<string, []>("hx_1")];
            tensor<int32, [3]> input_23_batch_first_transpose_perm_0 = const()[name = tensor<string, []>("input_23_batch_first_transpose_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, []> split_0_num_splits_0 = const()[name = tensor<string, []>("split_0_num_splits_0"), val = tensor<int32, []>(4)];
            tensor<int32, []> split_0_axis_0 = const()[name = tensor<string, []>("split_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [2, ?, 128]> split_0_0, tensor<fp32, [2, ?, 128]> split_0_1, tensor<fp32, [2, ?, 128]> split_0_2, tensor<fp32, [2, ?, 128]> split_0_3 = split(axis = split_0_axis_0, num_splits = split_0_num_splits_0, x = hx_1)[name = tensor<string, []>("split_0")];
            tensor<int32, []> split_1_num_splits_0 = const()[name = tensor<string, []>("split_1_num_splits_0"), val = tensor<int32, []>(4)];
            tensor<int32, []> split_1_axis_0 = const()[name = tensor<string, []>("split_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [2, ?, 128]> split_1_0, tensor<fp32, [2, ?, 128]> split_1_1, tensor<fp32, [2, ?, 128]> split_1_2, tensor<fp32, [2, ?, 128]> split_1_3 = split(axis = split_1_axis_0, num_splits = split_1_num_splits_0, x = hx_1)[name = tensor<string, []>("split_1")];
            tensor<fp32, [512]> add_0 = const()[name = tensor<string, []>("add_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(452800)))];
            tensor<fp32, [512]> add_1 = const()[name = tensor<string, []>("add_1"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(454912)))];
            tensor<fp32, [512, 60]> concat_6 = const()[name = tensor<string, []>("concat_6"), val = tensor<fp32, [512, 60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(457024)))];
            tensor<fp32, [512, 128]> concat_7 = const()[name = tensor<string, []>("concat_7"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(579968)))];
            tensor<fp32, [512, 60]> concat_8 = const()[name = tensor<string, []>("concat_8"), val = tensor<fp32, [512, 60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(842176)))];
            tensor<fp32, [512, 128]> concat_9 = const()[name = tensor<string, []>("concat_9"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(965120)))];
            tensor<int32, [2]> split_10_split_sizes_0 = const()[name = tensor<string, []>("split_10_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_10_axis_0 = const()[name = tensor<string, []>("split_10_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_10_0, tensor<fp32, [1, ?, 128]> split_10_1 = split(axis = split_10_axis_0, split_sizes = split_10_split_sizes_0, x = split_0_0)[name = tensor<string, []>("split_10")];
            tensor<int32, []> concat_10_axis_0 = const()[name = tensor<string, []>("concat_10_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_10_interleave_0 = const()[name = tensor<string, []>("concat_10_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_10 = concat(axis = concat_10_axis_0, interleave = concat_10_interleave_0, values = (split_10_0, split_10_1))[name = tensor<string, []>("concat_10")];
            tensor<int32, [1]> input_25_lstm_layer_0_lstm_h0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_lstm_h0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_lstm_layer_0_lstm_h0_reshaped = squeeze(axes = input_25_lstm_layer_0_lstm_h0_reshaped_axes_0, x = concat_10)[name = tensor<string, []>("input_25_lstm_layer_0_lstm_h0_reshaped")];
            tensor<int32, [2]> split_11_split_sizes_0 = const()[name = tensor<string, []>("split_11_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_11_axis_0 = const()[name = tensor<string, []>("split_11_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_11_0, tensor<fp32, [1, ?, 128]> split_11_1 = split(axis = split_11_axis_0, split_sizes = split_11_split_sizes_0, x = split_1_0)[name = tensor<string, []>("split_11")];
            tensor<int32, []> concat_11_axis_0 = const()[name = tensor<string, []>("concat_11_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_11_interleave_0 = const()[name = tensor<string, []>("concat_11_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_11 = concat(axis = concat_11_axis_0, interleave = concat_11_interleave_0, values = (split_11_0, split_11_1))[name = tensor<string, []>("concat_11")];
            tensor<int32, [1]> input_25_lstm_layer_0_lstm_c0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_lstm_c0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_lstm_layer_0_lstm_c0_reshaped = squeeze(axes = input_25_lstm_layer_0_lstm_c0_reshaped_axes_0, x = concat_11)[name = tensor<string, []>("input_25_lstm_layer_0_lstm_c0_reshaped")];
            tensor<string, []> input_25_lstm_layer_0_direction_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_25_lstm_layer_0_output_sequence_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_25_lstm_layer_0_recurrent_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_25_lstm_layer_0_cell_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_25_lstm_layer_0_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_0_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp32, [589, ?, 60]> input_23_batch_first_transpose = transpose(perm = input_23_batch_first_transpose_perm_0, x = input_23)[name = tensor<string, []>("transpose_5")];
            tensor<fp32, [589, ?, 256]> input_25_lstm_layer_0_0, tensor<fp32, [?, 256]> input_25_lstm_layer_0_1, tensor<fp32, [?, 256]> input_25_lstm_layer_0_2 = lstm(activation = input_25_lstm_layer_0_activation_0, bias = add_0, bias_back = add_1, cell_activation = input_25_lstm_layer_0_cell_activation_0, direction = input_25_lstm_layer_0_direction_0, initial_c = input_25_lstm_layer_0_lstm_c0_reshaped, initial_h = input_25_lstm_layer_0_lstm_h0_reshaped, output_sequence = input_25_lstm_layer_0_output_sequence_0, recurrent_activation = input_25_lstm_layer_0_recurrent_activation_0, weight_hh = concat_7, weight_hh_back = concat_9, weight_ih = concat_6, weight_ih_back = concat_8, x = input_23_batch_first_transpose)[name = tensor<string, []>("input_25_lstm_layer_0")];
            tensor<fp32, [512]> add_2 = const()[name = tensor<string, []>("add_2"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1227328)))];
            tensor<fp32, [512]> add_3 = const()[name = tensor<string, []>("add_3"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1229440)))];
            tensor<fp32, [512, 256]> concat_16 = const()[name = tensor<string, []>("concat_16"), val = tensor<fp32, [512, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1231552)))];
            tensor<fp32, [512, 128]> concat_17 = const()[name = tensor<string, []>("concat_17"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1755904)))];
            tensor<fp32, [512, 256]> concat_18 = const()[name = tensor<string, []>("concat_18"), val = tensor<fp32, [512, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2018112)))];
            tensor<fp32, [512, 128]> concat_19 = const()[name = tensor<string, []>("concat_19"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2542464)))];
            tensor<int32, [2]> split_20_split_sizes_0 = const()[name = tensor<string, []>("split_20_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_20_axis_0 = const()[name = tensor<string, []>("split_20_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_20_0, tensor<fp32, [1, ?, 128]> split_20_1 = split(axis = split_20_axis_0, split_sizes = split_20_split_sizes_0, x = split_0_1)[name = tensor<string, []>("split_20")];
            tensor<int32, []> concat_20_axis_0 = const()[name = tensor<string, []>("concat_20_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_20_interleave_0 = const()[name = tensor<string, []>("concat_20_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_20 = concat(axis = concat_20_axis_0, interleave = concat_20_interleave_0, values = (split_20_0, split_20_1))[name = tensor<string, []>("concat_20")];
            tensor<int32, [1]> input_25_lstm_layer_1_lstm_h0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_lstm_h0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_lstm_layer_1_lstm_h0_reshaped = squeeze(axes = input_25_lstm_layer_1_lstm_h0_reshaped_axes_0, x = concat_20)[name = tensor<string, []>("input_25_lstm_layer_1_lstm_h0_reshaped")];
            tensor<int32, [2]> split_21_split_sizes_0 = const()[name = tensor<string, []>("split_21_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_21_axis_0 = const()[name = tensor<string, []>("split_21_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_21_0, tensor<fp32, [1, ?, 128]> split_21_1 = split(axis = split_21_axis_0, split_sizes = split_21_split_sizes_0, x = split_1_1)[name = tensor<string, []>("split_21")];
            tensor<int32, []> concat_21_axis_0 = const()[name = tensor<string, []>("concat_21_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_21_interleave_0 = const()[name = tensor<string, []>("concat_21_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_21 = concat(axis = concat_21_axis_0, interleave = concat_21_interleave_0, values = (split_21_0, split_21_1))[name = tensor<string, []>("concat_21")];
            tensor<int32, [1]> input_25_lstm_layer_1_lstm_c0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_lstm_c0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_lstm_layer_1_lstm_c0_reshaped = squeeze(axes = input_25_lstm_layer_1_lstm_c0_reshaped_axes_0, x = concat_21)[name = tensor<string, []>("input_25_lstm_layer_1_lstm_c0_reshaped")];
            tensor<string, []> input_25_lstm_layer_1_direction_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_25_lstm_layer_1_output_sequence_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_25_lstm_layer_1_recurrent_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_25_lstm_layer_1_cell_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_25_lstm_layer_1_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_1_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp32, [589, ?, 256]> input_25_lstm_layer_1_0, tensor<fp32, [?, 256]> input_25_lstm_layer_1_1, tensor<fp32, [?, 256]> input_25_lstm_layer_1_2 = lstm(activation = input_25_lstm_layer_1_activation_0, bias = add_2, bias_back = add_3, cell_activation = input_25_lstm_layer_1_cell_activation_0, direction = input_25_lstm_layer_1_direction_0, initial_c = input_25_lstm_layer_1_lstm_c0_reshaped, initial_h = input_25_lstm_layer_1_lstm_h0_reshaped, output_sequence = input_25_lstm_layer_1_output_sequence_0, recurrent_activation = input_25_lstm_layer_1_recurrent_activation_0, weight_hh = concat_17, weight_hh_back = concat_19, weight_ih = concat_16, weight_ih_back = concat_18, x = input_25_lstm_layer_0_0)[name = tensor<string, []>("input_25_lstm_layer_1")];
            tensor<fp32, [512]> add_4 = const()[name = tensor<string, []>("add_4"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2804672)))];
            tensor<fp32, [512]> add_5 = const()[name = tensor<string, []>("add_5"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2806784)))];
            tensor<fp32, [512, 256]> concat_26 = const()[name = tensor<string, []>("concat_26"), val = tensor<fp32, [512, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2808896)))];
            tensor<fp32, [512, 128]> concat_27 = const()[name = tensor<string, []>("concat_27"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3333248)))];
            tensor<fp32, [512, 256]> concat_28 = const()[name = tensor<string, []>("concat_28"), val = tensor<fp32, [512, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3595456)))];
            tensor<fp32, [512, 128]> concat_29 = const()[name = tensor<string, []>("concat_29"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4119808)))];
            tensor<int32, [2]> split_30_split_sizes_0 = const()[name = tensor<string, []>("split_30_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_30_axis_0 = const()[name = tensor<string, []>("split_30_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_30_0, tensor<fp32, [1, ?, 128]> split_30_1 = split(axis = split_30_axis_0, split_sizes = split_30_split_sizes_0, x = split_0_2)[name = tensor<string, []>("split_30")];
            tensor<int32, []> concat_30_axis_0 = const()[name = tensor<string, []>("concat_30_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_30_interleave_0 = const()[name = tensor<string, []>("concat_30_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_30 = concat(axis = concat_30_axis_0, interleave = concat_30_interleave_0, values = (split_30_0, split_30_1))[name = tensor<string, []>("concat_30")];
            tensor<int32, [1]> input_25_lstm_layer_2_lstm_h0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_lstm_h0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_lstm_layer_2_lstm_h0_reshaped = squeeze(axes = input_25_lstm_layer_2_lstm_h0_reshaped_axes_0, x = concat_30)[name = tensor<string, []>("input_25_lstm_layer_2_lstm_h0_reshaped")];
            tensor<int32, [2]> split_31_split_sizes_0 = const()[name = tensor<string, []>("split_31_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_31_axis_0 = const()[name = tensor<string, []>("split_31_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_31_0, tensor<fp32, [1, ?, 128]> split_31_1 = split(axis = split_31_axis_0, split_sizes = split_31_split_sizes_0, x = split_1_2)[name = tensor<string, []>("split_31")];
            tensor<int32, []> concat_31_axis_0 = const()[name = tensor<string, []>("concat_31_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_31_interleave_0 = const()[name = tensor<string, []>("concat_31_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_31 = concat(axis = concat_31_axis_0, interleave = concat_31_interleave_0, values = (split_31_0, split_31_1))[name = tensor<string, []>("concat_31")];
            tensor<int32, [1]> input_25_lstm_layer_2_lstm_c0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_lstm_c0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_lstm_layer_2_lstm_c0_reshaped = squeeze(axes = input_25_lstm_layer_2_lstm_c0_reshaped_axes_0, x = concat_31)[name = tensor<string, []>("input_25_lstm_layer_2_lstm_c0_reshaped")];
            tensor<string, []> input_25_lstm_layer_2_direction_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_25_lstm_layer_2_output_sequence_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_25_lstm_layer_2_recurrent_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_25_lstm_layer_2_cell_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_25_lstm_layer_2_activation_0 = const()[name = tensor<string, []>("input_25_lstm_layer_2_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp32, [589, ?, 256]> input_25_lstm_layer_2_0, tensor<fp32, [?, 256]> input_25_lstm_layer_2_1, tensor<fp32, [?, 256]> input_25_lstm_layer_2_2 = lstm(activation = input_25_lstm_layer_2_activation_0, bias = add_4, bias_back = add_5, cell_activation = input_25_lstm_layer_2_cell_activation_0, direction = input_25_lstm_layer_2_direction_0, initial_c = input_25_lstm_layer_2_lstm_c0_reshaped, initial_h = input_25_lstm_layer_2_lstm_h0_reshaped, output_sequence = input_25_lstm_layer_2_output_sequence_0, recurrent_activation = input_25_lstm_layer_2_recurrent_activation_0, weight_hh = concat_27, weight_hh_back = concat_29, weight_ih = concat_26, weight_ih_back = concat_28, x = input_25_lstm_layer_1_0)[name = tensor<string, []>("input_25_lstm_layer_2")];
            tensor<fp32, [512]> add_6 = const()[name = tensor<string, []>("add_6"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4382016)))];
            tensor<fp32, [512]> add_7 = const()[name = tensor<string, []>("add_7"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4384128)))];
            tensor<fp32, [512, 256]> concat_36 = const()[name = tensor<string, []>("concat_36"), val = tensor<fp32, [512, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4386240)))];
            tensor<fp32, [512, 128]> concat_37 = const()[name = tensor<string, []>("concat_37"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4910592)))];
            tensor<fp32, [512, 256]> concat_38 = const()[name = tensor<string, []>("concat_38"), val = tensor<fp32, [512, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5172800)))];
            tensor<fp32, [512, 128]> concat_39 = const()[name = tensor<string, []>("concat_39"), val = tensor<fp32, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5697152)))];
            tensor<int32, [2]> split_40_split_sizes_0 = const()[name = tensor<string, []>("split_40_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_40_axis_0 = const()[name = tensor<string, []>("split_40_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_40_0, tensor<fp32, [1, ?, 128]> split_40_1 = split(axis = split_40_axis_0, split_sizes = split_40_split_sizes_0, x = split_0_3)[name = tensor<string, []>("split_40")];
            tensor<int32, []> concat_40_axis_0 = const()[name = tensor<string, []>("concat_40_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_40_interleave_0 = const()[name = tensor<string, []>("concat_40_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_40 = concat(axis = concat_40_axis_0, interleave = concat_40_interleave_0, values = (split_40_0, split_40_1))[name = tensor<string, []>("concat_40")];
            tensor<int32, [1]> input_25_batch_first_lstm_h0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_batch_first_lstm_h0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_batch_first_lstm_h0_reshaped = squeeze(axes = input_25_batch_first_lstm_h0_reshaped_axes_0, x = concat_40)[name = tensor<string, []>("input_25_batch_first_lstm_h0_reshaped")];
            tensor<int32, [2]> split_41_split_sizes_0 = const()[name = tensor<string, []>("split_41_split_sizes_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> split_41_axis_0 = const()[name = tensor<string, []>("split_41_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp32, [1, ?, 128]> split_41_0, tensor<fp32, [1, ?, 128]> split_41_1 = split(axis = split_41_axis_0, split_sizes = split_41_split_sizes_0, x = split_1_3)[name = tensor<string, []>("split_41")];
            tensor<int32, []> concat_41_axis_0 = const()[name = tensor<string, []>("concat_41_axis_0"), val = tensor<int32, []>(2)];
            tensor<bool, []> concat_41_interleave_0 = const()[name = tensor<string, []>("concat_41_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, ?, 256]> concat_41 = concat(axis = concat_41_axis_0, interleave = concat_41_interleave_0, values = (split_41_0, split_41_1))[name = tensor<string, []>("concat_41")];
            tensor<int32, [1]> input_25_batch_first_lstm_c0_reshaped_axes_0 = const()[name = tensor<string, []>("input_25_batch_first_lstm_c0_reshaped_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 256]> input_25_batch_first_lstm_c0_reshaped = squeeze(axes = input_25_batch_first_lstm_c0_reshaped_axes_0, x = concat_41)[name = tensor<string, []>("input_25_batch_first_lstm_c0_reshaped")];
            tensor<string, []> input_25_batch_first_direction_0 = const()[name = tensor<string, []>("input_25_batch_first_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_25_batch_first_output_sequence_0 = const()[name = tensor<string, []>("input_25_batch_first_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_25_batch_first_recurrent_activation_0 = const()[name = tensor<string, []>("input_25_batch_first_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_25_batch_first_cell_activation_0 = const()[name = tensor<string, []>("input_25_batch_first_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_25_batch_first_activation_0 = const()[name = tensor<string, []>("input_25_batch_first_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp32, [589, ?, 256]> input_25_batch_first_0, tensor<fp32, [?, 256]> input_25_batch_first_1, tensor<fp32, [?, 256]> input_25_batch_first_2 = lstm(activation = input_25_batch_first_activation_0, bias = add_6, bias_back = add_7, cell_activation = input_25_batch_first_cell_activation_0, direction = input_25_batch_first_direction_0, initial_c = input_25_batch_first_lstm_c0_reshaped, initial_h = input_25_batch_first_lstm_h0_reshaped, output_sequence = input_25_batch_first_output_sequence_0, recurrent_activation = input_25_batch_first_recurrent_activation_0, weight_hh = concat_37, weight_hh_back = concat_39, weight_ih = concat_36, weight_ih_back = concat_38, x = input_25_lstm_layer_2_0)[name = tensor<string, []>("input_25_batch_first")];
            tensor<int32, [3]> input_25_perm_0 = const()[name = tensor<string, []>("input_25_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp32, [?, 589, 256]> input_25 = transpose(perm = input_25_perm_0, x = input_25_batch_first_0)[name = tensor<string, []>("transpose_4")];
            tensor<fp32, [?, 589, 128]> input_27 = linear(bias = linear_0_bias, weight = linear_0_weight, x = input_25)[name = tensor<string, []>("linear_0")];
            tensor<fp32, []> var_220 = const()[name = tensor<string, []>("op_220"), val = tensor<fp32, []>(0x1.47ae14p-7)];
            tensor<fp32, [?, 589, 128]> input_29 = leaky_relu(alpha = var_220, x = input_27)[name = tensor<string, []>("input_29")];
            tensor<fp32, [?, 589, 128]> input_31 = linear(bias = linear_1_bias, weight = linear_1_weight, x = input_29)[name = tensor<string, []>("linear_1")];
            tensor<fp32, []> var_225 = const()[name = tensor<string, []>("op_225"), val = tensor<fp32, []>(0x1.47ae14p-7)];
            tensor<fp32, [?, 589, 128]> input_33 = leaky_relu(alpha = var_225, x = input_31)[name = tensor<string, []>("input_33")];
            tensor<fp32, [?, 589, 7]> input = linear(bias = classifier_bias, weight = classifier_weight, x = input_33)[name = tensor<string, []>("linear_2")];
            tensor<int32, []> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, []>(-1)];
            tensor<fp32, [?, 589, 7]> var_232_softmax = softmax(axis = var_231, x = input)[name = tensor<string, []>("op_232_softmax")];
            tensor<fp32, []> var_232_epsilon_0 = const()[name = tensor<string, []>("op_232_epsilon_0"), val = tensor<fp32, []>(0x1p-149)];
            tensor<fp32, [?, 589, 7]> log_probs = log(epsilon = var_232_epsilon_0, x = var_232_softmax)[name = tensor<string, []>("op_232")];
        } -> (log_probs);
}